avrxml/asf/thirdparty/atmel_rf4ce/lib/inc/atmega128rfa1.h
/**
 * @file atmega128rfa1.h
 *
 * @brief File contains register and command defines specific for AT86RF231.
 *
 * $Id: atmega128rfa1.h 27079 2011-06-08 05:44:08Z pawan.jadia $
 *
 * @author    Atmel Corporation: http://www.atmel.com
 * @author    Support email: avr@atmel.com
 */
/*
 * Copyright (c) 2009-2012, Atmel Corporation All rights reserved.
 *
 * 
 */

/* Prevent double inclusion */
#ifndef ATMEGA128RFA1_H
#define ATMEGA128RFA1_H

/* === INCLUDES ============================================================ */
/* Utilization of regular TAL */
#include "tal_types.h"
#include "avrtypes.h"

#if (TAL_TYPE == ATMEGARF_TAL_1)

/* === EXTERNALS =========================================================== */


/* === TYPES =============================================================== */


/* === MACROS ============================================================== */

#define TRX_SUPPORTED_CHANNELS          (0x07FFF800)

/**
 * Tolerance of the phyTransmitPower PIB attribute.  This is encoded
 * into the two MSBits of the attribute, and is effectively read-only.
 */
#define TX_PWR_TOLERANCE                (0x80)

/*
 * Typical timing values
 */
#define RST_PULSE_WIDTH_US                  (1)
#define P_ON_TO_CLKM_AVAILABLE_TYP_US       (380)
#define SLEEP_TO_TRX_OFF_TYP_US             (240) /* TRX Parameter: tTR2 typical value */
#define SLEEP_TO_TRX_OFF_MAX_US             (1000) /* TRX Parameter: tTR2 max. value */
#define TRX_OFF_TO_SLEEP_TIME_CLKM_CYCLES   (35)  /* TRX Parameter: tTR3 */
#define TRX_OFF_TO_PLL_ON_TIME_US           (110) /* TRX Parameter: tTR4 */
#define RESET_TO_TRX_OFF_TYP_US             (37) /* TRX Parameter: tTR13 typical value */
#define RESET_TO_TRX_OFF_MAX_US             (1000) /* TRX Parameter: tTR2 max. value */
#define TRX_IRQ_DELAY_US                    (9)
#define IRQ_PROCESSING_DLY_US               (32)

/*
 * CSMA timimg parameters
 */
#define CCA_DETECTION_TIME_SYM          (8)
#define CCA_PROCESS_TIME_SYM            (1)
#define CCA_DURATION_SYM                (CCA_DETECTION_TIME_SYM + CCA_PROCESS_TIME_SYM)
#define CSMA_PROCESSING_TIME_US         (100)
#define CCA_PREPARATION_DURATION_US     (50)
#define CCA_PRE_START_DURATION_US       (20)
#define PRE_TX_DURATION_US              (32)    // 16 us processing delay +
                                                // 16 us software handling duration

#define HAVE_REGISTER_MAP (1)
/** Offset for register PINA
 */
#define RG_PINA                          (0x20)

/** Offset for register DDRA
 */
#define RG_DDRA                          (0x21)

/** Offset for register PORTA
 */
#define RG_PORTA                         (0x22)

/** Offset for register PINB
 */
#define RG_PINB                          (0x23)

/** Offset for register DDRB
 */
#define RG_DDRB                          (0x24)

/** Offset for register PORTB
 */
#define RG_PORTB                         (0x25)

/** Offset for register PINC
 */
#define RG_PINC                          (0x26)

/** Offset for register DDRC
 */
#define RG_DDRC                          (0x27)

/** Offset for register PORTC
 */
#define RG_PORTC                         (0x28)

/** Offset for register PIND
 */
#define RG_PIND                          (0x29)

/** Offset for register DDRD
 */
#define RG_DDRD                          (0x2a)

/** Offset for register PORTD
 */
#define RG_PORTD                         (0x2b)

/** Offset for register PINE
 */
#define RG_PINE                          (0x2c)

/** Offset for register DDRE
 */
#define RG_DDRE                          (0x2d)

/** Offset for register PORTE
 */
#define RG_PORTE                         (0x2e)

/** Offset for register PINF
 */
#define RG_PINF                          (0x2f)

/** Offset for register DDRF
 */
#define RG_DDRF                          (0x30)

/** Offset for register PORTF
 */
#define RG_PORTF                         (0x31)

/** Offset for register PING
 */
#define RG_PING                          (0x32)

/** Offset for register DDRG
 */
#define RG_DDRG                          (0x33)

/** Offset for register PORTG
 */
#define RG_PORTG                         (0x34)

/** Offset for register TIFR0
 */
#define RG_TIFR0                         (0x35)
  /** Access parameters for sub-register TOV0 in register @ref RG_TIFR0
   */
#define SR_TOV0                      0x35, 0x01, 0
  /** Access parameters for sub-register OCF0A in register @ref RG_TIFR0
   */
#define SR_OCF0A                     0x35, 0x02, 1
  /** Access parameters for sub-register OCF0B in register @ref RG_TIFR0
   */
#define SR_OCF0B                     0x35, 0x04, 2

/** Offset for register TIFR1
 */
#define RG_TIFR1                         (0x36)
  /** Access parameters for sub-register TOV1 in register @ref RG_TIFR1
   */
#define SR_TOV1                      0x36, 0x01, 0
  /** Access parameters for sub-register OCF1A in register @ref RG_TIFR1
   */
#define SR_OCF1A                     0x36, 0x02, 1
  /** Access parameters for sub-register OCF1B in register @ref RG_TIFR1
   */
#define SR_OCF1B                     0x36, 0x04, 2
  /** Access parameters for sub-register OCF1C in register @ref RG_TIFR1
   */
#define SR_OCF1C                     0x36, 0x08, 3
  /** Access parameters for sub-register ICF1 in register @ref RG_TIFR1
   */
#define SR_ICF1                      0x36, 0x20, 5

/** Offset for register TIFR2
 */
#define RG_TIFR2                         (0x37)
  /** Access parameters for sub-register TOV2 in register @ref RG_TIFR2
   */
#define SR_TOV2                      0x37, 0x01, 0
  /** Access parameters for sub-register OCF2A in register @ref RG_TIFR2
   */
#define SR_OCF2A                     0x37, 0x02, 1
  /** Access parameters for sub-register OCF2B in register @ref RG_TIFR2
   */
#define SR_OCF2B                     0x37, 0x04, 2

/** Offset for register TIFR3
 */
#define RG_TIFR3                         (0x38)
  /** Access parameters for sub-register TOV3 in register @ref RG_TIFR3
   */
#define SR_TOV3                      0x38, 0x01, 0
  /** Access parameters for sub-register OCF3A in register @ref RG_TIFR3
   */
#define SR_OCF3A                     0x38, 0x02, 1
  /** Access parameters for sub-register OCF3B in register @ref RG_TIFR3
   */
#define SR_OCF3B                     0x38, 0x04, 2
  /** Access parameters for sub-register OCF3C in register @ref RG_TIFR3
   */
#define SR_OCF3C                     0x38, 0x08, 3
  /** Access parameters for sub-register ICF3 in register @ref RG_TIFR3
   */
#define SR_ICF3                      0x38, 0x20, 5

/** Offset for register TIFR4
 */
#define RG_TIFR4                         (0x39)
  /** Access parameters for sub-register TOV4 in register @ref RG_TIFR4
   */
#define SR_TOV4                      0x39, 0x01, 0
  /** Access parameters for sub-register OCF4A in register @ref RG_TIFR4
   */
#define SR_OCF4A                     0x39, 0x02, 1
  /** Access parameters for sub-register OCF4B in register @ref RG_TIFR4
   */
#define SR_OCF4B                     0x39, 0x04, 2
  /** Access parameters for sub-register OCF4C in register @ref RG_TIFR4
   */
#define SR_OCF4C                     0x39, 0x08, 3
  /** Access parameters for sub-register ICF4 in register @ref RG_TIFR4
   */
#define SR_ICF4                      0x39, 0x20, 5

/** Offset for register TIFR5
 */
#define RG_TIFR5                         (0x3a)
  /** Access parameters for sub-register TOV5 in register @ref RG_TIFR5
   */
#define SR_TOV5                      0x3a, 0x01, 0
  /** Access parameters for sub-register OCF5A in register @ref RG_TIFR5
   */
#define SR_OCF5A                     0x3a, 0x02, 1
  /** Access parameters for sub-register OCF5B in register @ref RG_TIFR5
   */
#define SR_OCF5B                     0x3a, 0x04, 2
  /** Access parameters for sub-register OCF5C in register @ref RG_TIFR5
   */
#define SR_OCF5C                     0x3a, 0x08, 3
  /** Access parameters for sub-register ICF5 in register @ref RG_TIFR5
   */
#define SR_ICF5                      0x3a, 0x20, 5

