avrxml/asf/thirdparty/atmel_rf4ce/lib/inc/atmega128rfa1.h
/** Offset for register PCIFR
 */
#define RG_PCIFR                         (0x3b)
  /** Access parameters for sub-register PCIF in register @ref RG_PCIFR
   */
#define SR_PCIF                      0x3b, 0x07, 0

/** Offset for register EIFR
 */
#define RG_EIFR                          (0x3c)
  /** Access parameters for sub-register INTF in register @ref RG_EIFR
   */
#define SR_INTF                      0x3c, 0xff, 0

/** Offset for register EIMSK
 */
#define RG_EIMSK                         (0x3d)
  /** Access parameters for sub-register INT in register @ref RG_EIMSK
   */
#define SR_INT                       0x3d, 0xff, 0

/** Offset for register GPIOR0
 */
#define RG_GPIOR0                        (0x3e)
  /** Access parameters for sub-register GPIOR0 in register @ref RG_GPIOR0
   */
#define SR_GPIOR0                    0x3e, 0xff, 0

/** Offset for register EECR
 */
#define RG_EECR                          (0x3f)
  /** Access parameters for sub-register EERE in register @ref RG_EECR
   */
#define SR_EERE                      0x3f, 0x01, 0
  /** Access parameters for sub-register EEPE in register @ref RG_EECR
   */
#define SR_EEPE                      0x3f, 0x02, 1
  /** Access parameters for sub-register EEMPE in register @ref RG_EECR
   */
#define SR_EEMPE                     0x3f, 0x04, 2
  /** Access parameters for sub-register EERIE in register @ref RG_EECR
   */
#define SR_EERIE                     0x3f, 0x08, 3
  /** Access parameters for sub-register EEPM in register @ref RG_EECR
   */
#define SR_EEPM                      0x3f, 0x30, 4

/** Offset for register EEDR
 */
#define RG_EEDR                          (0x40)

/** Offset for register EEAR
 */
#define RG_EEAR                          (0x41)

/** Offset for register GTCCR
 */
#define RG_GTCCR                         (0x43)
  /** Access parameters for sub-register PSRSYNC in register @ref RG_GTCCR
   */
#define SR_PSRSYNC                   0x43, 0x01, 0
  /** Access parameters for sub-register PSRASY in register @ref RG_GTCCR
   */
#define SR_PSRASY                    0x43, 0x02, 1
  /** Access parameters for sub-register TSM in register @ref RG_GTCCR
   */
#define SR_TSM                       0x43, 0x80, 7

/** Offset for register TCCR0A
 */
#define RG_TCCR0A                        (0x44)
  /** Access parameters for sub-register WGM0 in register @ref RG_TCCR0A
   */
#define SR_WGM0                      0x44, 0x03, 0
  /** Access parameters for sub-register COM0B in register @ref RG_TCCR0A
   */
#define SR_COM0B                     0x44, 0x30, 4
  /** Access parameters for sub-register COM0A in register @ref RG_TCCR0A
   */
#define SR_COM0A                     0x44, 0xc0, 6

/** Offset for register TCCR0B
 */
#define RG_TCCR0B                        (0x45)
  /** Access parameters for sub-register CS0 in register @ref RG_TCCR0B
   */
#define SR_CS0                       0x45, 0x07, 0
  /** Access parameters for sub-register WGM02 in register @ref RG_TCCR0B
   */
#define SR_WGM02                     0x45, 0x08, 3
  /** Access parameters for sub-register FOC0B in register @ref RG_TCCR0B
   */
#define SR_FOC0B                     0x45, 0x40, 6
  /** Access parameters for sub-register FOC0A in register @ref RG_TCCR0B
   */
#define SR_FOC0A                     0x45, 0x80, 7

/** Offset for register TCNT0
 */
#define RG_TCNT0                         (0x46)

/** Offset for register OCR0A
 */
#define RG_OCR0A                         (0x47)

/** Offset for register OCR0B
 */
#define RG_OCR0B                         (0x48)

/** Offset for register GPIOR1
 */
#define RG_GPIOR1                        (0x4a)
  /** Access parameters for sub-register GPIOR1 in register @ref RG_GPIOR1
   */
#define SR_GPIOR1                    0x4a, 0xff, 0

/** Offset for register GPIOR2
 */
#define RG_GPIOR2                        (0x4b)
  /** Access parameters for sub-register GPIOR2 in register @ref RG_GPIOR2
   */
#define SR_GPIOR2                    0x4b, 0xff, 0

/** Offset for register SPCR
 */
#define RG_SPCR                          (0x4c)
  /** Access parameters for sub-register SPR in register @ref RG_SPCR
   */
#define SR_SPR                       0x4c, 0x03, 0
  /** Access parameters for sub-register CPHA in register @ref RG_SPCR
   */
#define SR_CPHA                      0x4c, 0x04, 2
  /** Access parameters for sub-register CPOL in register @ref RG_SPCR
   */
#define SR_CPOL                      0x4c, 0x08, 3
  /** Access parameters for sub-register MSTR in register @ref RG_SPCR
   */
#define SR_MSTR                      0x4c, 0x10, 4
  /** Access parameters for sub-register DORD in register @ref RG_SPCR
   */
#define SR_DORD                      0x4c, 0x20, 5
  /** Access parameters for sub-register SPE in register @ref RG_SPCR
   */
#define SR_SPE                       0x4c, 0x40, 6
  /** Access parameters for sub-register SPIE in register @ref RG_SPCR
   */
#define SR_SPIE                      0x4c, 0x80, 7

/** Offset for register SPSR
 */
#define RG_SPSR                          (0x4d)
  /** Access parameters for sub-register SPI2X in register @ref RG_SPSR
   */
#define SR_SPI2X                     0x4d, 0x01, 0
  /** Access parameters for sub-register WCOL in register @ref RG_SPSR
   */
#define SR_WCOL                      0x4d, 0x40, 6
  /** Access parameters for sub-register SPIF in register @ref RG_SPSR
   */
#define SR_SPIF                      0x4d, 0x80, 7

/** Offset for register SPDR
 */
#define RG_SPDR                          (0x4e)

/** Offset for register ACSR
 */
#define RG_ACSR                          (0x50)
  /** Access parameters for sub-register ACIS in register @ref RG_ACSR
   */
#define SR_ACIS                      0x50, 0x03, 0
  /** Access parameters for sub-register ACIC in register @ref RG_ACSR
   */
#define SR_ACIC                      0x50, 0x04, 2
  /** Access parameters for sub-register ACIE in register @ref RG_ACSR
   */
#define SR_ACIE                      0x50, 0x08, 3
  /** Access parameters for sub-register ACI in register @ref RG_ACSR
   */
#define SR_ACI                       0x50, 0x10, 4
  /** Access parameters for sub-register ACO in register @ref RG_ACSR
   */
#define SR_ACO                       0x50, 0x20, 5
  /** Access parameters for sub-register ACBG in register @ref RG_ACSR
   */
#define SR_ACBG                      0x50, 0x40, 6
  /** Access parameters for sub-register ACD in register @ref RG_ACSR
   */
#define SR_ACD                       0x50, 0x80, 7

/** Offset for register OCDR
 */
#define RG_OCDR                          (0x51)

/** Offset for register SMCR
 */
#define RG_SMCR                          (0x53)
  /** Access parameters for sub-register SE in register @ref RG_SMCR
   */
#define SR_SE                        0x53, 0x01, 0
  /** Access parameters for sub-register SM in register @ref RG_SMCR
   */
#define SR_SM                        0x53, 0x0e, 1

/** Offset for register MCUSR
 */
#define RG_MCUSR                         (0x54)
  /** Access parameters for sub-register PORF in register @ref RG_MCUSR
   */
#define SR_PORF                      0x54, 0x01, 0
  /** Access parameters for sub-register EXTRF in register @ref RG_MCUSR
   */
#define SR_EXTRF                     0x54, 0x02, 1
  /** Access parameters for sub-register BORF in register @ref RG_MCUSR
   */
#define SR_BORF                      0x54, 0x04, 2
  /** Access parameters for sub-register WDRF in register @ref RG_MCUSR
   */
#define SR_WDRF                      0x54, 0x08, 3
  /** Access parameters for sub-register JTRF in register @ref RG_MCUSR
   */
#define SR_JTRF                      0x54, 0x10, 4

/** Offset for register MCUCR
 */
#define RG_MCUCR                         (0x55)
  /** Access parameters for sub-register IVCE in register @ref RG_MCUCR
   */
#define SR_IVCE                      0x55, 0x01, 0
  /** Access parameters for sub-register IVSEL in register @ref RG_MCUCR
   */
#define SR_IVSEL                     0x55, 0x02, 1
  /** Access parameters for sub-register PUD in register @ref RG_MCUCR
   */
#define SR_PUD                       0x55, 0x10, 4
  /** Access parameters for sub-register JTD in register @ref RG_MCUCR
   */
#define SR_JTD                       0x55, 0x80, 7

/** Offset for register SPMCSR
 */
#define RG_SPMCSR                        (0x57)
  /** Access parameters for sub-register SPMEN in register @ref RG_SPMCSR
   */
#define SR_SPMEN                     0x57, 0x01, 0
  /** Access parameters for sub-register PGERS in register @ref RG_SPMCSR
   */
#define SR_PGERS                     0x57, 0x02, 1
  /** Access parameters for sub-register PGWRT in register @ref RG_SPMCSR
   */
#define SR_PGWRT                     0x57, 0x04, 2
  /** Access parameters for sub-register BLBSET in register @ref RG_SPMCSR
   */
#define SR_BLBSET                    0x57, 0x08, 3
  /** Access parameters for sub-register RWWSRE in register @ref RG_SPMCSR
   */
#define SR_RWWSRE                    0x57, 0x10, 4
  /** Access parameters for sub-register SIGRD in register @ref RG_SPMCSR
   */
#define SR_SIGRD                     0x57, 0x20, 5
  /** Access parameters for sub-register RWWSB in register @ref RG_SPMCSR
   */
#define SR_RWWSB                     0x57, 0x40, 6
  /** Access parameters for sub-register SPMIE in register @ref RG_SPMCSR
   */
#define SR_SPMIE                     0x57, 0x80, 7

/** Offset for register RAMPZ
 */
#define RG_RAMPZ                         (0x5b)

/** Offset for register SP
 */
#define RG_SP                            (0x5d)

/** Offset for register SREG
 */
#define RG_SREG                          (0x5f)
  /** Access parameters for sub-register C in register @ref RG_SREG
   */
#define SR_C                         0x5f, 0x01, 0
  /** Access parameters for sub-register Z in register @ref RG_SREG
   */
#define SR_Z                         0x5f, 0x02, 1
  /** Access parameters for sub-register N in register @ref RG_SREG
   */
#define SR_N                         0x5f, 0x04, 2
  /** Access parameters for sub-register V in register @ref RG_SREG
   */
#define SR_V                         0x5f, 0x08, 3
  /** Access parameters for sub-register S in register @ref RG_SREG
   */
#define SR_S                         0x5f, 0x10, 4
  /** Access parameters for sub-register H in register @ref RG_SREG
   */
#define SR_H                         0x5f, 0x20, 5
  /** Access parameters for sub-register T in register @ref RG_SREG
   */
#define SR_T                         0x5f, 0x40, 6
  /** Access parameters for sub-register I in register @ref RG_SREG
   */
#define SR_I                         0x5f, 0x80, 7

/** Offset for register WDTCSR
 */
#define RG_WDTCSR                        (0x60)
  /** Access parameters for sub-register WDP in register @ref RG_WDTCSR
   */
#define SR_WDP                       0x60, 0x07, 0
  /** Access parameters for sub-register WDE in register @ref RG_WDTCSR
   */
#define SR_WDE                       0x60, 0x08, 3
  /** Access parameters for sub-register WDCE in register @ref RG_WDTCSR
   */
#define SR_WDCE                      0x60, 0x10, 4
  /** Access parameters for sub-register WDIE in register @ref RG_WDTCSR
   */
#define SR_WDIE                      0x60, 0x40, 6
  /** Access parameters for sub-register WDIF in register @ref RG_WDTCSR
   */
#define SR_WDIF                      0x60, 0x80, 7

/** Offset for register CLKPR
 */
#define RG_CLKPR                         (0x61)
  /** Access parameters for sub-register CLKPS in register @ref RG_CLKPR
   */
#define SR_CLKPS                     0x61, 0x0f, 0
  /** Access parameters for sub-register CLKPCE in register @ref RG_CLKPR
   */
#define SR_CLKPCE                    0x61, 0x80, 7

