avrxml/asf/thirdparty/atmel_rf4ce/lib/inc/atmega128rfa1.h
/** Offset for register PRR2
 */
#define RG_PRR2                          (0x63)
  /** Access parameters for sub-register PRRAM in register @ref RG_PRR2
   */
#define SR_PRRAM                     0x63, 0x0f, 0

/** Offset for register PRR0
 */
#define RG_PRR0                          (0x64)
  /** Access parameters for sub-register PRADC in register @ref RG_PRR0
   */
#define SR_PRADC                     0x64, 0x01, 0
  /** Access parameters for sub-register PRUSART0 in register @ref RG_PRR0
   */
#define SR_PRUSART0                  0x64, 0x02, 1
  /** Access parameters for sub-register PRSPI in register @ref RG_PRR0
   */
#define SR_PRSPI                     0x64, 0x04, 2
  /** Access parameters for sub-register PRTIM1 in register @ref RG_PRR0
   */
#define SR_PRTIM1                    0x64, 0x08, 3
  /** Access parameters for sub-register PRPGA in register @ref RG_PRR0
   */
#define SR_PRPGA                     0x64, 0x10, 4
  /** Access parameters for sub-register PRTIM0 in register @ref RG_PRR0
   */
#define SR_PRTIM0                    0x64, 0x20, 5
  /** Access parameters for sub-register PRTIM2 in register @ref RG_PRR0
   */
#define SR_PRTIM2                    0x64, 0x40, 6
  /** Access parameters for sub-register PRTWI in register @ref RG_PRR0
   */
#define SR_PRTWI                     0x64, 0x80, 7

/** Offset for register PRR1
 */
#define RG_PRR1                          (0x65)
  /** Access parameters for sub-register PRUSART in register @ref RG_PRR1
   */
#define SR_PRUSART                   0x65, 0x07, 0
  /** Access parameters for sub-register PRTIM3 in register @ref RG_PRR1
   */
#define SR_PRTIM3                    0x65, 0x08, 3
  /** Access parameters for sub-register PRTIM4 in register @ref RG_PRR1
   */
#define SR_PRTIM4                    0x65, 0x10, 4
  /** Access parameters for sub-register PRTIM5 in register @ref RG_PRR1
   */
#define SR_PRTIM5                    0x65, 0x20, 5
  /** Access parameters for sub-register PRTRX24 in register @ref RG_PRR1
   */
#define SR_PRTRX24                   0x65, 0x40, 6

/** Offset for register OSCCAL
 */
#define RG_OSCCAL                        (0x66)

/** Offset for register PCICR
 */
#define RG_PCICR                         (0x68)
  /** Access parameters for sub-register PCIE in register @ref RG_PCICR
   */
#define SR_PCIE                      0x68, 0x07, 0

/** Offset for register EICRA
 */
#define RG_EICRA                         (0x69)
  /** Access parameters for sub-register ISC0 in register @ref RG_EICRA
   */
#define SR_ISC0                      0x69, 0x03, 0
  /** Access parameters for sub-register ISC1 in register @ref RG_EICRA
   */
#define SR_ISC1                      0x69, 0x0c, 2
  /** Access parameters for sub-register ISC2 in register @ref RG_EICRA
   */
#define SR_ISC2                      0x69, 0x30, 4
  /** Access parameters for sub-register ISC3 in register @ref RG_EICRA
   */
#define SR_ISC3                      0x69, 0xc0, 6

/** Offset for register EICRB
 */
#define RG_EICRB                         (0x6a)
  /** Access parameters for sub-register ISC4 in register @ref RG_EICRB
   */
#define SR_ISC4                      0x6a, 0x03, 0
  /** Access parameters for sub-register ISC5 in register @ref RG_EICRB
   */
#define SR_ISC5                      0x6a, 0x0c, 2
  /** Access parameters for sub-register ISC6 in register @ref RG_EICRB
   */
#define SR_ISC6                      0x6a, 0x30, 4
  /** Access parameters for sub-register ISC7 in register @ref RG_EICRB
   */
#define SR_ISC7                      0x6a, 0xc0, 6

/** Offset for register PCMSK0
 */
#define RG_PCMSK0                        (0x6b)

/** Offset for register PCMSK1
 */
#define RG_PCMSK1                        (0x6c)

/** Offset for register PCMSK2
 */
#define RG_PCMSK2                        (0x6d)

/** Offset for register TIMSK0
 */
#define RG_TIMSK0                        (0x6e)
  /** Access parameters for sub-register TOIE0 in register @ref RG_TIMSK0
   */
#define SR_TOIE0                     0x6e, 0x01, 0
  /** Access parameters for sub-register OCIE0A in register @ref RG_TIMSK0
   */
#define SR_OCIE0A                    0x6e, 0x02, 1
  /** Access parameters for sub-register OCIE0B in register @ref RG_TIMSK0
   */
#define SR_OCIE0B                    0x6e, 0x04, 2

/** Offset for register TIMSK1
 */
#define RG_TIMSK1                        (0x6f)
  /** Access parameters for sub-register TOIE1 in register @ref RG_TIMSK1
   */
#define SR_TOIE1                     0x6f, 0x01, 0
  /** Access parameters for sub-register OCIE1A in register @ref RG_TIMSK1
   */
#define SR_OCIE1A                    0x6f, 0x02, 1
  /** Access parameters for sub-register OCIE1B in register @ref RG_TIMSK1
   */
#define SR_OCIE1B                    0x6f, 0x04, 2
  /** Access parameters for sub-register OCIE1C in register @ref RG_TIMSK1
   */
#define SR_OCIE1C                    0x6f, 0x08, 3
  /** Access parameters for sub-register ICIE1 in register @ref RG_TIMSK1
   */
#define SR_ICIE1                     0x6f, 0x20, 5

/** Offset for register TIMSK2
 */
#define RG_TIMSK2                        (0x70)
  /** Access parameters for sub-register TOIE2 in register @ref RG_TIMSK2
   */
#define SR_TOIE2                     0x70, 0x01, 0
  /** Access parameters for sub-register OCIE2A in register @ref RG_TIMSK2
   */
#define SR_OCIE2A                    0x70, 0x02, 1
  /** Access parameters for sub-register OCIE2B in register @ref RG_TIMSK2
   */
#define SR_OCIE2B                    0x70, 0x04, 2

/** Offset for register TIMSK3
 */
#define RG_TIMSK3                        (0x71)
  /** Access parameters for sub-register TOIE3 in register @ref RG_TIMSK3
   */
#define SR_TOIE3                     0x71, 0x01, 0
  /** Access parameters for sub-register OCIE3A in register @ref RG_TIMSK3
   */
#define SR_OCIE3A                    0x71, 0x02, 1
  /** Access parameters for sub-register OCIE3B in register @ref RG_TIMSK3
   */
#define SR_OCIE3B                    0x71, 0x04, 2
  /** Access parameters for sub-register OCIE3C in register @ref RG_TIMSK3
   */
#define SR_OCIE3C                    0x71, 0x08, 3
  /** Access parameters for sub-register ICIE3 in register @ref RG_TIMSK3
   */
#define SR_ICIE3                     0x71, 0x20, 5

/** Offset for register TIMSK4
 */
#define RG_TIMSK4                        (0x72)
  /** Access parameters for sub-register TOIE4 in register @ref RG_TIMSK4
   */
#define SR_TOIE4                     0x72, 0x01, 0
  /** Access parameters for sub-register OCIE4A in register @ref RG_TIMSK4
   */
#define SR_OCIE4A                    0x72, 0x02, 1
  /** Access parameters for sub-register OCIE4B in register @ref RG_TIMSK4
   */
#define SR_OCIE4B                    0x72, 0x04, 2
  /** Access parameters for sub-register OCIE4C in register @ref RG_TIMSK4
   */
#define SR_OCIE4C                    0x72, 0x08, 3
  /** Access parameters for sub-register ICIE4 in register @ref RG_TIMSK4
   */
#define SR_ICIE4                     0x72, 0x20, 5

/** Offset for register TIMSK5
 */
#define RG_TIMSK5                        (0x73)
  /** Access parameters for sub-register TOIE5 in register @ref RG_TIMSK5
   */
#define SR_TOIE5                     0x73, 0x01, 0
  /** Access parameters for sub-register OCIE5A in register @ref RG_TIMSK5
   */
#define SR_OCIE5A                    0x73, 0x02, 1
  /** Access parameters for sub-register OCIE5B in register @ref RG_TIMSK5
   */
#define SR_OCIE5B                    0x73, 0x04, 2
  /** Access parameters for sub-register OCIE5C in register @ref RG_TIMSK5
   */
#define SR_OCIE5C                    0x73, 0x08, 3
  /** Access parameters for sub-register ICIE5 in register @ref RG_TIMSK5
   */
#define SR_ICIE5                     0x73, 0x20, 5

/** Offset for register NHVCR
 */
#define RG_NHVCR                         (0x74)
  /** Access parameters for sub-register SWPW in register @ref RG_NHVCR
   */
#define SR_SWPW                      0x74, 0x07, 0
  /** Access parameters for sub-register SEPW in register @ref RG_NHVCR
   */
#define SR_SEPW                      0x74, 0x38, 3
  /** Access parameters for sub-register ENVMR in register @ref RG_NHVCR
   */
#define SR_ENVMR                     0x74, 0x40, 6
  /** Access parameters for sub-register ENVMP in register @ref RG_NHVCR
   */
#define SR_ENVMP                     0x74, 0x80, 7

/** Offset for register NEMCR
 */
#define RG_NEMCR                         (0x75)

