avrxml/asf/thirdparty/atmel_rf4ce/lib/inc/atmega128rfa1.h
/** Offset for register ADCSRC
 */
#define RG_ADCSRC                        (0x77)
  /** Access parameters for sub-register ADSUT in register @ref RG_ADCSRC
   */
#define SR_ADSUT                     0x77, 0x3f, 0
  /** Access parameters for sub-register ADTHT in register @ref RG_ADCSRC
   */
#define SR_ADTHT                     0x77, 0xc0, 6

/** Offset for register ADC
 */
#define RG_ADC                           (0x78)

/** Offset for register ADCSRA
 */
#define RG_ADCSRA                        (0x7a)
  /** Access parameters for sub-register ADPS in register @ref RG_ADCSRA
   */
#define SR_ADPS                      0x7a, 0x07, 0
  /** Access parameters for sub-register ADIE in register @ref RG_ADCSRA
   */
#define SR_ADIE                      0x7a, 0x08, 3
  /** Access parameters for sub-register ADIF in register @ref RG_ADCSRA
   */
#define SR_ADIF                      0x7a, 0x10, 4
  /** Access parameters for sub-register ADATE in register @ref RG_ADCSRA
   */
#define SR_ADATE                     0x7a, 0x20, 5
  /** Access parameters for sub-register ADSC in register @ref RG_ADCSRA
   */
#define SR_ADSC                      0x7a, 0x40, 6
  /** Access parameters for sub-register ADEN in register @ref RG_ADCSRA
   */
#define SR_ADEN                      0x7a, 0x80, 7

/** Offset for register ADCSRB
 */
#define RG_ADCSRB                        (0x7b)
  /** Access parameters for sub-register ADTS in register @ref RG_ADCSRB
   */
#define SR_ADTS                      0x7b, 0x07, 0
  /** Access parameters for sub-register MUX5 in register @ref RG_ADCSRB
   */
#define SR_MUX5                      0x7b, 0x08, 3
  /** Access parameters for sub-register ACCH in register @ref RG_ADCSRB
   */
#define SR_ACCH                      0x7b, 0x10, 4
  /** Access parameters for sub-register REFOK in register @ref RG_ADCSRB
   */
#define SR_REFOK                     0x7b, 0x20, 5
  /** Access parameters for sub-register ACME in register @ref RG_ADCSRB
   */
#define SR_ACME                      0x7b, 0x40, 6
  /** Access parameters for sub-register AVDDOK in register @ref RG_ADCSRB
   */
#define SR_AVDDOK                    0x7b, 0x80, 7

/** Offset for register ADMUX
 */
#define RG_ADMUX                         (0x7c)
  /** Access parameters for sub-register MUX in register @ref RG_ADMUX
   */
#define SR_MUX                       0x7c, 0x1f, 0
  /** Access parameters for sub-register ADLAR in register @ref RG_ADMUX
   */
#define SR_ADLAR                     0x7c, 0x20, 5
  /** Access parameters for sub-register REFS in register @ref RG_ADMUX
   */
#define SR_REFS                      0x7c, 0xc0, 6

/** Offset for register DIDR2
 */
#define RG_DIDR2                         (0x7d)
  /** Access parameters for sub-register ADC8D in register @ref RG_DIDR2
   */
#define SR_ADC8D                     0x7d, 0x01, 0
  /** Access parameters for sub-register ADC9D in register @ref RG_DIDR2
   */
#define SR_ADC9D                     0x7d, 0x02, 1
  /** Access parameters for sub-register ADC10D in register @ref RG_DIDR2
   */
#define SR_ADC10D                    0x7d, 0x04, 2
  /** Access parameters for sub-register ADC11D in register @ref RG_DIDR2
   */
#define SR_ADC11D                    0x7d, 0x08, 3
  /** Access parameters for sub-register ADC12D in register @ref RG_DIDR2
   */
#define SR_ADC12D                    0x7d, 0x10, 4
  /** Access parameters for sub-register ADC13D in register @ref RG_DIDR2
   */
#define SR_ADC13D                    0x7d, 0x20, 5
  /** Access parameters for sub-register ADC14D in register @ref RG_DIDR2
   */
#define SR_ADC14D                    0x7d, 0x40, 6
  /** Access parameters for sub-register ADC15D in register @ref RG_DIDR2
   */
#define SR_ADC15D                    0x7d, 0x80, 7

/** Offset for register DIDR0
 */
#define RG_DIDR0                         (0x7e)
  /** Access parameters for sub-register ADC0D in register @ref RG_DIDR0
   */
#define SR_ADC0D                     0x7e, 0x01, 0
  /** Access parameters for sub-register ADC1D in register @ref RG_DIDR0
   */
#define SR_ADC1D                     0x7e, 0x02, 1
  /** Access parameters for sub-register ADC2D in register @ref RG_DIDR0
   */
#define SR_ADC2D                     0x7e, 0x04, 2
  /** Access parameters for sub-register ADC3D in register @ref RG_DIDR0
   */
#define SR_ADC3D                     0x7e, 0x08, 3
  /** Access parameters for sub-register ADC4D in register @ref RG_DIDR0
   */
#define SR_ADC4D                     0x7e, 0x10, 4
  /** Access parameters for sub-register ADC5D in register @ref RG_DIDR0
   */
#define SR_ADC5D                     0x7e, 0x20, 5
  /** Access parameters for sub-register ADC6D in register @ref RG_DIDR0
   */
#define SR_ADC6D                     0x7e, 0x40, 6
  /** Access parameters for sub-register ADC7D in register @ref RG_DIDR0
   */
#define SR_ADC7D                     0x7e, 0x80, 7

/** Offset for register DIDR1
 */
#define RG_DIDR1                         (0x7f)
  /** Access parameters for sub-register AIN0D in register @ref RG_DIDR1
   */
#define SR_AIN0D                     0x7f, 0x01, 0
  /** Access parameters for sub-register AIN1D in register @ref RG_DIDR1
   */
#define SR_AIN1D                     0x7f, 0x02, 1

/** Offset for register TCCR1A
 */
#define RG_TCCR1A                        (0x80)
  /** Access parameters for sub-register TCCR1A_WGM1 in register @ref RG_TCCR1A
   */
#define SR_TCCR1A_WGM1               0x80, 0x03, 0
  /** Access parameters for sub-register COM1C in register @ref RG_TCCR1A
   */
#define SR_COM1C                     0x80, 0x0c, 2
  /** Access parameters for sub-register COM1B in register @ref RG_TCCR1A
   */
#define SR_COM1B                     0x80, 0x30, 4
  /** Access parameters for sub-register COM1A in register @ref RG_TCCR1A
   */
#define SR_COM1A                     0x80, 0xc0, 6

/** Offset for register TCCR1B
 */
#define RG_TCCR1B                        (0x81)
  /** Access parameters for sub-register CS1 in register @ref RG_TCCR1B
   */
#define SR_CS1                       0x81, 0x07, 0
  /** Access parameters for sub-register TCCR1B_WGM1 in register @ref RG_TCCR1B
   */
#define SR_TCCR1B_WGM1               0x81, 0x18, 3
  /** Access parameters for sub-register ICES1 in register @ref RG_TCCR1B
   */
#define SR_ICES1                     0x81, 0x40, 6
  /** Access parameters for sub-register ICNC1 in register @ref RG_TCCR1B
   */
#define SR_ICNC1                     0x81, 0x80, 7

/** Offset for register TCCR1C
 */
#define RG_TCCR1C                        (0x82)
  /** Access parameters for sub-register FOC1C in register @ref RG_TCCR1C
   */
#define SR_FOC1C                     0x82, 0x20, 5
  /** Access parameters for sub-register FOC1B in register @ref RG_TCCR1C
   */
#define SR_FOC1B                     0x82, 0x40, 6
  /** Access parameters for sub-register FOC1A in register @ref RG_TCCR1C
   */
#define SR_FOC1A                     0x82, 0x80, 7

