avrxml/asf/thirdparty/atmel_rf4ce/lib/inc/atmega128rfa1.h
/** Offset for register TCNT1
 */
#define RG_TCNT1                         (0x84)

/** Offset for register ICR1
 */
#define RG_ICR1                          (0x86)

/** Offset for register OCR1A
 */
#define RG_OCR1A                         (0x88)

/** Offset for register OCR1B
 */
#define RG_OCR1B                         (0x8a)

/** Offset for register OCR1C
 */
#define RG_OCR1C                         (0x8c)

/** Offset for register TCCR3A
 */
#define RG_TCCR3A                        (0x90)
  /** Access parameters for sub-register TCCR3A_WGM3 in register @ref RG_TCCR3A
   */
#define SR_TCCR3A_WGM3               0x90, 0x03, 0
  /** Access parameters for sub-register COM3C in register @ref RG_TCCR3A
   */
#define SR_COM3C                     0x90, 0x0c, 2
  /** Access parameters for sub-register COM3B in register @ref RG_TCCR3A
   */
#define SR_COM3B                     0x90, 0x30, 4
  /** Access parameters for sub-register COM3A in register @ref RG_TCCR3A
   */
#define SR_COM3A                     0x90, 0xc0, 6

/** Offset for register TCCR3B
 */
#define RG_TCCR3B                        (0x91)
  /** Access parameters for sub-register CS3 in register @ref RG_TCCR3B
   */
#define SR_CS3                       0x91, 0x07, 0
  /** Access parameters for sub-register TCCR3B_WGM3 in register @ref RG_TCCR3B
   */
#define SR_TCCR3B_WGM3               0x91, 0x18, 3
  /** Access parameters for sub-register ICES3 in register @ref RG_TCCR3B
   */
#define SR_ICES3                     0x91, 0x40, 6
  /** Access parameters for sub-register ICNC3 in register @ref RG_TCCR3B
   */
#define SR_ICNC3                     0x91, 0x80, 7

/** Offset for register TCCR3C
 */
#define RG_TCCR3C                        (0x92)
  /** Access parameters for sub-register FOC3C in register @ref RG_TCCR3C
   */
#define SR_FOC3C                     0x92, 0x20, 5
  /** Access parameters for sub-register FOC3B in register @ref RG_TCCR3C
   */
#define SR_FOC3B                     0x92, 0x40, 6
  /** Access parameters for sub-register FOC3A in register @ref RG_TCCR3C
   */
#define SR_FOC3A                     0x92, 0x80, 7

/** Offset for register TCNT3
 */
#define RG_TCNT3                         (0x94)

/** Offset for register ICR3
 */
#define RG_ICR3                          (0x96)

/** Offset for register OCR3A
 */
#define RG_OCR3A                         (0x98)

/** Offset for register OCR3B
 */
#define RG_OCR3B                         (0x9a)

/** Offset for register OCR3C
 */
#define RG_OCR3C                         (0x9c)

/** Offset for register TCCR4A
 */
#define RG_TCCR4A                        (0xa0)
  /** Access parameters for sub-register TCCR4A_WGM4 in register @ref RG_TCCR4A
   */
#define SR_TCCR4A_WGM4               0xa0, 0x03, 0
  /** Access parameters for sub-register COM4C in register @ref RG_TCCR4A
   */
#define SR_COM4C                     0xa0, 0x0c, 2
  /** Access parameters for sub-register COM4B in register @ref RG_TCCR4A
   */
#define SR_COM4B                     0xa0, 0x30, 4
  /** Access parameters for sub-register COM4A in register @ref RG_TCCR4A
   */
#define SR_COM4A                     0xa0, 0xc0, 6

/** Offset for register TCCR4B
 */
#define RG_TCCR4B                        (0xa1)
  /** Access parameters for sub-register CS4 in register @ref RG_TCCR4B
   */
#define SR_CS4                       0xa1, 0x07, 0
  /** Access parameters for sub-register TCCR4B_WGM4 in register @ref RG_TCCR4B
   */
#define SR_TCCR4B_WGM4               0xa1, 0x18, 3
  /** Access parameters for sub-register ICES4 in register @ref RG_TCCR4B
   */
#define SR_ICES4                     0xa1, 0x40, 6
  /** Access parameters for sub-register ICNC4 in register @ref RG_TCCR4B
   */
#define SR_ICNC4                     0xa1, 0x80, 7

/** Offset for register TCCR4C
 */
#define RG_TCCR4C                        (0xa2)
  /** Access parameters for sub-register FOC4C in register @ref RG_TCCR4C
   */
#define SR_FOC4C                     0xa2, 0x20, 5
  /** Access parameters for sub-register FOC4B in register @ref RG_TCCR4C
   */
#define SR_FOC4B                     0xa2, 0x40, 6
  /** Access parameters for sub-register FOC4A in register @ref RG_TCCR4C
   */
#define SR_FOC4A                     0xa2, 0x80, 7

/** Offset for register TCNT4
 */
#define RG_TCNT4                         (0xa4)

/** Offset for register ICR4
 */
#define RG_ICR4                          (0xa6)

/** Offset for register OCR4A
 */
#define RG_OCR4A                         (0xa8)

/** Offset for register OCR4B
 */
#define RG_OCR4B                         (0xaa)

/** Offset for register OCR4C
 */
#define RG_OCR4C                         (0xac)

/** Offset for register TCCR2A
 */
#define RG_TCCR2A                        (0xb0)
  /** Access parameters for sub-register WGM2 in register @ref RG_TCCR2A
   */
#define SR_WGM2                      0xb0, 0x03, 0
  /** Access parameters for sub-register COM2B in register @ref RG_TCCR2A
   */
#define SR_COM2B                     0xb0, 0x30, 4
  /** Access parameters for sub-register COM2A in register @ref RG_TCCR2A
   */
#define SR_COM2A                     0xb0, 0xc0, 6

/** Offset for register TCCR2B
 */
#define RG_TCCR2B                        (0xb1)
  /** Access parameters for sub-register CS2 in register @ref RG_TCCR2B
   */
#define SR_CS2                       0xb1, 0x07, 0
  /** Access parameters for sub-register WGM22 in register @ref RG_TCCR2B
   */
#define SR_WGM22                     0xb1, 0x08, 3
  /** Access parameters for sub-register FOC2B in register @ref RG_TCCR2B
   */
#define SR_FOC2B                     0xb1, 0x40, 6
  /** Access parameters for sub-register FOC2A in register @ref RG_TCCR2B
   */
#define SR_FOC2A                     0xb1, 0x80, 7

/** Offset for register TCNT2
 */
#define RG_TCNT2                         (0xb2)

/** Offset for register OCR2A
 */
#define RG_OCR2A                         (0xb3)

/** Offset for register OCR2B
 */
#define RG_OCR2B                         (0xb4)

/** Offset for register ASSR
 */
#define RG_ASSR                          (0xb6)
  /** Access parameters for sub-register TCR2BUB in register @ref RG_ASSR
   */
#define SR_TCR2BUB                   0xb6, 0x01, 0
  /** Access parameters for sub-register TCR2AUB in register @ref RG_ASSR
   */
#define SR_TCR2AUB                   0xb6, 0x02, 1
  /** Access parameters for sub-register OCR2BUB in register @ref RG_ASSR
   */
#define SR_OCR2BUB                   0xb6, 0x04, 2
  /** Access parameters for sub-register OCR2AUB in register @ref RG_ASSR
   */
#define SR_OCR2AUB                   0xb6, 0x08, 3
  /** Access parameters for sub-register TCN2UB in register @ref RG_ASSR
   */
#define SR_TCN2UB                    0xb6, 0x10, 4
  /** Access parameters for sub-register AS2 in register @ref RG_ASSR
   */
#define SR_AS2                       0xb6, 0x20, 5
  /** Access parameters for sub-register EXCLK in register @ref RG_ASSR
   */
#define SR_EXCLK                     0xb6, 0x40, 6
  /** Access parameters for sub-register EXCLKAMR in register @ref RG_ASSR
   */
#define SR_EXCLKAMR                  0xb6, 0x80, 7

/** Offset for register TWBR
 */
#define RG_TWBR                          (0xb8)

/** Offset for register TWSR
 */
#define RG_TWSR                          (0xb9)
  /** Access parameters for sub-register TWPS in register @ref RG_TWSR
   */
#define SR_TWPS                      0xb9, 0x03, 0
  /** Access parameters for sub-register TWS in register @ref RG_TWSR
   */
#define SR_TWS                       0xb9, 0xf8, 3

/** Offset for register TWAR
 */
#define RG_TWAR                          (0xba)
  /** Access parameters for sub-register TWGCE in register @ref RG_TWAR
   */
#define SR_TWGCE                     0xba, 0x01, 0
  /** Access parameters for sub-register TWA in register @ref RG_TWAR
   */
#define SR_TWA                       0xba, 0xfe, 1

/** Offset for register TWDR
 */
#define RG_TWDR                          (0xbb)

