avrxml/asf/thirdparty/atmel_rf4ce/lib/inc/atmega128rfa1.h
/** Offset for register TWCR
 */
#define RG_TWCR                          (0xbc)
  /** Access parameters for sub-register TWIE in register @ref RG_TWCR
   */
#define SR_TWIE                      0xbc, 0x01, 0
  /** Access parameters for sub-register TWEN in register @ref RG_TWCR
   */
#define SR_TWEN                      0xbc, 0x04, 2
  /** Access parameters for sub-register TWWC in register @ref RG_TWCR
   */
#define SR_TWWC                      0xbc, 0x08, 3
  /** Access parameters for sub-register TWSTO in register @ref RG_TWCR
   */
#define SR_TWSTO                     0xbc, 0x10, 4
  /** Access parameters for sub-register TWSTA in register @ref RG_TWCR
   */
#define SR_TWSTA                     0xbc, 0x20, 5
  /** Access parameters for sub-register TWEA in register @ref RG_TWCR
   */
#define SR_TWEA                      0xbc, 0x40, 6
  /** Access parameters for sub-register TWINT in register @ref RG_TWCR
   */
#define SR_TWINT                     0xbc, 0x80, 7

/** Offset for register TWAMR
 */
#define RG_TWAMR                         (0xbd)
  /** Access parameters for sub-register TWAM in register @ref RG_TWAMR
   */
#define SR_TWAM                      0xbd, 0xfe, 1

/** Offset for register UCSR0A
 */
#define RG_UCSR0A                        (0xc0)
  /** Access parameters for sub-register MPCM0 in register @ref RG_UCSR0A
   */
#define SR_MPCM0                     0xc0, 0x01, 0
  /** Access parameters for sub-register U2X0 in register @ref RG_UCSR0A
   */
#define SR_U2X0                      0xc0, 0x02, 1
  /** Access parameters for sub-register UPE0 in register @ref RG_UCSR0A
   */
#define SR_UPE0                      0xc0, 0x04, 2
  /** Access parameters for sub-register DOR0 in register @ref RG_UCSR0A
   */
#define SR_DOR0                      0xc0, 0x08, 3
  /** Access parameters for sub-register FE0 in register @ref RG_UCSR0A
   */
#define SR_FE0                       0xc0, 0x10, 4
  /** Access parameters for sub-register UDRE0 in register @ref RG_UCSR0A
   */
#define SR_UDRE0                     0xc0, 0x20, 5
  /** Access parameters for sub-register TXC0 in register @ref RG_UCSR0A
   */
#define SR_TXC0                      0xc0, 0x40, 6
  /** Access parameters for sub-register RXC0 in register @ref RG_UCSR0A
   */
#define SR_RXC0                      0xc0, 0x80, 7

/** Offset for register UCSR0B
 */
#define RG_UCSR0B                        (0xc1)
  /** Access parameters for sub-register TXB80 in register @ref RG_UCSR0B
   */
#define SR_TXB80                     0xc1, 0x01, 0
  /** Access parameters for sub-register RXB80 in register @ref RG_UCSR0B
   */
#define SR_RXB80                     0xc1, 0x02, 1
  /** Access parameters for sub-register UCSZ02 in register @ref RG_UCSR0B
   */
#define SR_UCSZ02                    0xc1, 0x04, 2
  /** Access parameters for sub-register TXEN0 in register @ref RG_UCSR0B
   */
#define SR_TXEN0                     0xc1, 0x08, 3
  /** Access parameters for sub-register RXEN0 in register @ref RG_UCSR0B
   */
#define SR_RXEN0                     0xc1, 0x10, 4
  /** Access parameters for sub-register UDRIE0 in register @ref RG_UCSR0B
   */
#define SR_UDRIE0                    0xc1, 0x20, 5
  /** Access parameters for sub-register TXCIE0 in register @ref RG_UCSR0B
   */
#define SR_TXCIE0                    0xc1, 0x40, 6
  /** Access parameters for sub-register RXCIE0 in register @ref RG_UCSR0B
   */
#define SR_RXCIE0                    0xc1, 0x80, 7

/** Offset for register UCSR0C
 */
#define RG_UCSR0C                        (0xc2)
  /** Access parameters for sub-register UCPOL0 in register @ref RG_UCSR0C
   */
#define SR_UCPOL0                    0xc2, 0x01, 0
  /** Access parameters for sub-register UCSZ0 in register @ref RG_UCSR0C
   */
#define SR_UCSZ0                     0xc2, 0x06, 1
  /** Access parameters for sub-register USBS0 in register @ref RG_UCSR0C
   */
#define SR_USBS0                     0xc2, 0x08, 3
  /** Access parameters for sub-register UPM0 in register @ref RG_UCSR0C
   */
#define SR_UPM0                      0xc2, 0x30, 4
  /** Access parameters for sub-register UMSEL0 in register @ref RG_UCSR0C
   */
#define SR_UMSEL0                    0xc2, 0xc0, 6

/** Offset for register UBRR0
 */
#define RG_UBRR0                         (0xc4)

/** Offset for register UDR0
 */
#define RG_UDR0                          (0xc6)

/** Offset for register UCSR1A
 */
#define RG_UCSR1A                        (0xc8)
  /** Access parameters for sub-register MPCM1 in register @ref RG_UCSR1A
   */
#define SR_MPCM1                     0xc8, 0x01, 0
  /** Access parameters for sub-register U2X1 in register @ref RG_UCSR1A
   */
#define SR_U2X1                      0xc8, 0x02, 1
  /** Access parameters for sub-register UPE1 in register @ref RG_UCSR1A
   */
#define SR_UPE1                      0xc8, 0x04, 2
  /** Access parameters for sub-register DOR1 in register @ref RG_UCSR1A
   */
#define SR_DOR1                      0xc8, 0x08, 3
  /** Access parameters for sub-register FE1 in register @ref RG_UCSR1A
   */
#define SR_FE1                       0xc8, 0x10, 4
  /** Access parameters for sub-register UDRE1 in register @ref RG_UCSR1A
   */
#define SR_UDRE1                     0xc8, 0x20, 5
  /** Access parameters for sub-register TXC1 in register @ref RG_UCSR1A
   */
#define SR_TXC1                      0xc8, 0x40, 6
  /** Access parameters for sub-register RXC1 in register @ref RG_UCSR1A
   */
#define SR_RXC1                      0xc8, 0x80, 7

/** Offset for register UCSR1B
 */
#define RG_UCSR1B                        (0xc9)
  /** Access parameters for sub-register TXB81 in register @ref RG_UCSR1B
   */
#define SR_TXB81                     0xc9, 0x01, 0
  /** Access parameters for sub-register RXB81 in register @ref RG_UCSR1B
   */
#define SR_RXB81                     0xc9, 0x02, 1
  /** Access parameters for sub-register UCSZ12 in register @ref RG_UCSR1B
   */
#define SR_UCSZ12                    0xc9, 0x04, 2
  /** Access parameters for sub-register TXEN1 in register @ref RG_UCSR1B
   */
#define SR_TXEN1                     0xc9, 0x08, 3
  /** Access parameters for sub-register RXEN1 in register @ref RG_UCSR1B
   */
#define SR_RXEN1                     0xc9, 0x10, 4
  /** Access parameters for sub-register UDRIE1 in register @ref RG_UCSR1B
   */
#define SR_UDRIE1                    0xc9, 0x20, 5
  /** Access parameters for sub-register TXCIE1 in register @ref RG_UCSR1B
   */
#define SR_TXCIE1                    0xc9, 0x40, 6
  /** Access parameters for sub-register RXCIE1 in register @ref RG_UCSR1B
   */
#define SR_RXCIE1                    0xc9, 0x80, 7

/** Offset for register UCSR1C
 */
#define RG_UCSR1C                        (0xca)
  /** Access parameters for sub-register UCPOL1 in register @ref RG_UCSR1C
   */
#define SR_UCPOL1                    0xca, 0x01, 0
  /** Access parameters for sub-register UCSZ1 in register @ref RG_UCSR1C
   */
#define SR_UCSZ1                     0xca, 0x06, 1
  /** Access parameters for sub-register USBS1 in register @ref RG_UCSR1C
   */
#define SR_USBS1                     0xca, 0x08, 3
  /** Access parameters for sub-register UPM1 in register @ref RG_UCSR1C
   */
#define SR_UPM1                      0xca, 0x30, 4
  /** Access parameters for sub-register UMSEL1 in register @ref RG_UCSR1C
   */
#define SR_UMSEL1                    0xca, 0xc0, 6

/** Offset for register UBRR1
 */
#define RG_UBRR1                         (0xcc)

/** Offset for register UDR1
 */
#define RG_UDR1                          (0xce)

