avrxml/asf/thirdparty/atmel_rf4ce/lib/inc/atmega128rfa1.h
/** Offset for register ATBR18
 */
#define RG_ATBR18                        (0xd0)

/** Offset for register ATBR33
 */
#define RG_ATBR33                        (0xd1)

/** Offset for register SCCR0
 */
#define RG_SCCR0                         (0xdc)
  /** Access parameters for sub-register SCCMP in register @ref RG_SCCR0
   */
#define SR_SCCMP                     0xdc, 0x07, 0
  /** Access parameters for sub-register SCTSE in register @ref RG_SCCR0
   */
#define SR_SCTSE                     0xdc, 0x08, 3
  /** Access parameters for sub-register SCCKSEL in register @ref RG_SCCR0
   */
#define SR_SCCKSEL                   0xdc, 0x10, 4
  /** Access parameters for sub-register SCEN in register @ref RG_SCCR0
   */
#define SR_SCEN                      0xdc, 0x20, 5
  /** Access parameters for sub-register SCMBTS in register @ref RG_SCCR0
   */
#define SR_SCMBTS                    0xdc, 0x40, 6
  /** Access parameters for sub-register SCRES in register @ref RG_SCCR0
   */
#define SR_SCRES                     0xdc, 0x80, 7

/** Offset for register SCCR1
 */
#define RG_SCCR1                         (0xdd)
  /** Access parameters for sub-register SCENBO in register @ref RG_SCCR1
   */
#define SR_SCENBO                    0xdd, 0x01, 0

/** Offset for register SCSR
 */
#define RG_SCSR                          (0xde)
  /** Access parameters for sub-register SCBSY in register @ref RG_SCSR
   */
#define SR_SCBSY                     0xde, 0x01, 0

/** Offset for register SCIRQM
 */
#define RG_SCIRQM                        (0xdf)
  /** Access parameters for sub-register IRQMCP in register @ref RG_SCIRQM
   */
#define SR_IRQMCP                    0xdf, 0x07, 0
  /** Access parameters for sub-register IRQMOF in register @ref RG_SCIRQM
   */
#define SR_IRQMOF                    0xdf, 0x08, 3
  /** Access parameters for sub-register IRQMBO in register @ref RG_SCIRQM
   */
#define SR_IRQMBO                    0xdf, 0x10, 4

/** Offset for register SCIRQS
 */
#define RG_SCIRQS                        (0xe0)
  /** Access parameters for sub-register IRQSCP in register @ref RG_SCIRQS
   */
#define SR_IRQSCP                    0xe0, 0x07, 0
  /** Access parameters for sub-register IRQSOF in register @ref RG_SCIRQS
   */
#define SR_IRQSOF                    0xe0, 0x08, 3
  /** Access parameters for sub-register IRQSBO in register @ref RG_SCIRQS
   */
#define SR_IRQSBO                    0xe0, 0x10, 4

/** Offset for register SCCNTLL
 */
#define RG_SCCNTLL                       (0xe1)
  /** Access parameters for sub-register SCCNTLL in register @ref RG_SCCNTLL
   */
#define SR_SCCNTLL                   0xe1, 0xff, 0

/** Offset for register SCCNTLH
 */
#define RG_SCCNTLH                       (0xe2)
  /** Access parameters for sub-register SCCNTLH in register @ref RG_SCCNTLH
   */
#define SR_SCCNTLH                   0xe2, 0xff, 0

/** Offset for register SCCNTHL
 */
#define RG_SCCNTHL                       (0xe3)
  /** Access parameters for sub-register SCCNTHL in register @ref RG_SCCNTHL
   */
#define SR_SCCNTHL                   0xe3, 0xff, 0

/** Offset for register SCCNTHH
 */
#define RG_SCCNTHH                       (0xe4)
  /** Access parameters for sub-register SCCNTHH in register @ref RG_SCCNTHH
   */
#define SR_SCCNTHH                   0xe4, 0xff, 0

/** Offset for register SCBTSRLL
 */
#define RG_SCBTSRLL                      (0xe5)
  /** Access parameters for sub-register SCBTSRLL in register @ref RG_SCBTSRLL
   */
#define SR_SCBTSRLL                  0xe5, 0xff, 0

/** Offset for register SCBTSRLH
 */
#define RG_SCBTSRLH                      (0xe6)
  /** Access parameters for sub-register SCBTSRLH in register @ref RG_SCBTSRLH
   */
#define SR_SCBTSRLH                  0xe6, 0xff, 0

/** Offset for register SCBTSRHL
 */
#define RG_SCBTSRHL                      (0xe7)
  /** Access parameters for sub-register SCBTSRHL in register @ref RG_SCBTSRHL
   */
#define SR_SCBTSRHL                  0xe7, 0xff, 0

/** Offset for register SCBTSRHH
 */
#define RG_SCBTSRHH                      (0xe8)
  /** Access parameters for sub-register SCBTSRHH in register @ref RG_SCBTSRHH
   */
#define SR_SCBTSRHH                  0xe8, 0xff, 0

/** Offset for register SCTSRLL
 */
#define RG_SCTSRLL                       (0xe9)
  /** Access parameters for sub-register SCTSRLL in register @ref RG_SCTSRLL
   */
#define SR_SCTSRLL                   0xe9, 0xff, 0

/** Offset for register SCTSRLH
 */
#define RG_SCTSRLH                       (0xea)
  /** Access parameters for sub-register SCTSRLH in register @ref RG_SCTSRLH
   */
#define SR_SCTSRLH                   0xea, 0xff, 0

/** Offset for register SCTSRHL
 */
#define RG_SCTSRHL                       (0xeb)
  /** Access parameters for sub-register SCTSRHL in register @ref RG_SCTSRHL
   */
#define SR_SCTSRHL                   0xeb, 0xff, 0

/** Offset for register SCTSRHH
 */
#define RG_SCTSRHH                       (0xec)
  /** Access parameters for sub-register SCTSRHH in register @ref RG_SCTSRHH
   */
#define SR_SCTSRHH                   0xec, 0xff, 0

/** Offset for register SCOCR3LL
 */
#define RG_SCOCR3LL                      (0xed)
  /** Access parameters for sub-register SCOCR3LL in register @ref RG_SCOCR3LL
   */
#define SR_SCOCR3LL                  0xed, 0xff, 0

/** Offset for register SCOCR3LH
 */
#define RG_SCOCR3LH                      (0xee)
  /** Access parameters for sub-register SCOCR3LH in register @ref RG_SCOCR3LH
   */
#define SR_SCOCR3LH                  0xee, 0xff, 0

/** Offset for register SCOCR3HL
 */
#define RG_SCOCR3HL                      (0xef)
  /** Access parameters for sub-register SCOCR3HL in register @ref RG_SCOCR3HL
   */
#define SR_SCOCR3HL                  0xef, 0xff, 0

/** Offset for register SCOCR3HH
 */
#define RG_SCOCR3HH                      (0xf0)
  /** Access parameters for sub-register SCOCR3HH in register @ref RG_SCOCR3HH
   */
#define SR_SCOCR3HH                  0xf0, 0xff, 0

/** Offset for register SCOCR2LL
 */
#define RG_SCOCR2LL                      (0xf1)
  /** Access parameters for sub-register SCOCR2LL in register @ref RG_SCOCR2LL
   */
#define SR_SCOCR2LL                  0xf1, 0xff, 0

/** Offset for register SCOCR2LH
 */
#define RG_SCOCR2LH                      (0xf2)
  /** Access parameters for sub-register SCOCR2LH in register @ref RG_SCOCR2LH
   */
#define SR_SCOCR2LH                  0xf2, 0xff, 0

