avrxml/asf/thirdparty/atmel_rf4ce/lib/inc/atmega128rfa1.h
/** Offset for register SCOCR2HL
 */
#define RG_SCOCR2HL                      (0xf3)
  /** Access parameters for sub-register SCOCR2HL in register @ref RG_SCOCR2HL
   */
#define SR_SCOCR2HL                  0xf3, 0xff, 0

/** Offset for register SCOCR2HH
 */
#define RG_SCOCR2HH                      (0xf4)
  /** Access parameters for sub-register SCOCR2HH in register @ref RG_SCOCR2HH
   */
#define SR_SCOCR2HH                  0xf4, 0xff, 0

/** Offset for register SCOCR1LL
 */
#define RG_SCOCR1LL                      (0xf5)
  /** Access parameters for sub-register SCOCR1LL in register @ref RG_SCOCR1LL
   */
#define SR_SCOCR1LL                  0xf5, 0xff, 0

/** Offset for register SCOCR1LH
 */
#define RG_SCOCR1LH                      (0xf6)
  /** Access parameters for sub-register SCOCR1LH in register @ref RG_SCOCR1LH
   */
#define SR_SCOCR1LH                  0xf6, 0xff, 0

/** Offset for register SCOCR1HL
 */
#define RG_SCOCR1HL                      (0xf7)
  /** Access parameters for sub-register SCOCR1HL in register @ref RG_SCOCR1HL
   */
#define SR_SCOCR1HL                  0xf7, 0xff, 0

/** Offset for register SCOCR1HH
 */
#define RG_SCOCR1HH                      (0xf8)
  /** Access parameters for sub-register SCOCR1HH in register @ref RG_SCOCR1HH
   */
#define SR_SCOCR1HH                  0xf8, 0xff, 0

/** Offset for register TCCR5A
 */
#define RG_TCCR5A                        (0x120)
  /** Access parameters for sub-register TCCR5A_WGM5 in register @ref RG_TCCR5A
   */
#define SR_TCCR5A_WGM5               0x120, 0x03, 0
  /** Access parameters for sub-register COM5C in register @ref RG_TCCR5A
   */
#define SR_COM5C                     0x120, 0x0c, 2
  /** Access parameters for sub-register COM5B in register @ref RG_TCCR5A
   */
#define SR_COM5B                     0x120, 0x30, 4
  /** Access parameters for sub-register COM5A in register @ref RG_TCCR5A
   */
#define SR_COM5A                     0x120, 0xc0, 6

/** Offset for register TCCR5B
 */
#define RG_TCCR5B                        (0x121)
  /** Access parameters for sub-register CS5 in register @ref RG_TCCR5B
   */
#define SR_CS5                       0x121, 0x07, 0
  /** Access parameters for sub-register TCCR5B_WGM5 in register @ref RG_TCCR5B
   */
#define SR_TCCR5B_WGM5               0x121, 0x18, 3
  /** Access parameters for sub-register ICES5 in register @ref RG_TCCR5B
   */
#define SR_ICES5                     0x121, 0x40, 6
  /** Access parameters for sub-register ICNC5 in register @ref RG_TCCR5B
   */
#define SR_ICNC5                     0x121, 0x80, 7

/** Offset for register TCCR5C
 */
#define RG_TCCR5C                        (0x122)
  /** Access parameters for sub-register FOC5C in register @ref RG_TCCR5C
   */
#define SR_FOC5C                     0x122, 0x20, 5
  /** Access parameters for sub-register FOC5B in register @ref RG_TCCR5C
   */
#define SR_FOC5B                     0x122, 0x40, 6
  /** Access parameters for sub-register FOC5A in register @ref RG_TCCR5C
   */
#define SR_FOC5A                     0x122, 0x80, 7

/** Offset for register TCNT5
 */
#define RG_TCNT5                         (0x124)

/** Offset for register ICR5
 */
#define RG_ICR5                          (0x126)

/** Offset for register OCR5A
 */
#define RG_OCR5A                         (0x128)

/** Offset for register OCR5B
 */
#define RG_OCR5B                         (0x12a)

/** Offset for register OCR5C
 */
#define RG_OCR5C                         (0x12c)

/** Offset for register LLCR
 */
#define RG_LLCR                          (0x12f)
  /** Access parameters for sub-register LLENCAL in register @ref RG_LLCR
   */
#define SR_LLENCAL                   0x12f, 0x01, 0
  /** Access parameters for sub-register LLSHORT in register @ref RG_LLCR
   */
#define SR_LLSHORT                   0x12f, 0x02, 1
  /** Access parameters for sub-register LLTCO in register @ref RG_LLCR
   */
#define SR_LLTCO                     0x12f, 0x04, 2
  /** Access parameters for sub-register LLCAL in register @ref RG_LLCR
   */
#define SR_LLCAL                     0x12f, 0x08, 3
  /** Access parameters for sub-register LLCOMP in register @ref RG_LLCR
   */
#define SR_LLCOMP                    0x12f, 0x10, 4
  /** Access parameters for sub-register LLDONE in register @ref RG_LLCR
   */
#define SR_LLDONE                    0x12f, 0x20, 5

/** Offset for register LLDRL
 */
#define RG_LLDRL                         (0x130)
  /** Access parameters for sub-register LLDRL in register @ref RG_LLDRL
   */
#define SR_LLDRL                     0x130, 0x0f, 0

/** Offset for register LLDRH
 */
#define RG_LLDRH                         (0x131)
  /** Access parameters for sub-register LLDRH in register @ref RG_LLDRH
   */
#define SR_LLDRH                     0x131, 0x1f, 0

/** Offset for register DRTRAM3
 */
#define RG_DRTRAM3                       (0x132)
  /** Access parameters for sub-register DRTRAM3_DRTMN in register @ref RG_DRTRAM3
   */
#define SR_DRTRAM3_DRTMN             0x132, 0x03, 0
  /** Access parameters for sub-register DRTRAM3_DRTMP in register @ref RG_DRTRAM3
   */
#define SR_DRTRAM3_DRTMP             0x132, 0x0c, 2
  /** Access parameters for sub-register DRTRAM3_ENDRT in register @ref RG_DRTRAM3
   */
#define SR_DRTRAM3_ENDRT             0x132, 0x10, 4
  /** Access parameters for sub-register DRTRAM3_DRTSWOK in register @ref RG_DRTRAM3
   */
#define SR_DRTRAM3_DRTSWOK           0x132, 0x20, 5

/** Offset for register DRTRAM2
 */
#define RG_DRTRAM2                       (0x133)
  /** Access parameters for sub-register DRTRAM2_DRTMN in register @ref RG_DRTRAM2
   */
#define SR_DRTRAM2_DRTMN             0x133, 0x03, 0
  /** Access parameters for sub-register DRTRAM2_DRTMP in register @ref RG_DRTRAM2
   */
#define SR_DRTRAM2_DRTMP             0x133, 0x0c, 2
  /** Access parameters for sub-register DRTRAM2_ENDRT in register @ref RG_DRTRAM2
   */
#define SR_DRTRAM2_ENDRT             0x133, 0x10, 4
  /** Access parameters for sub-register DRTRAM2_DRTSWOK in register @ref RG_DRTRAM2
   */
#define SR_DRTRAM2_DRTSWOK           0x133, 0x20, 5
  /** Access parameters for sub-register DISPC in register @ref RG_DRTRAM2
   */
#define SR_DISPC                     0x133, 0x80, 7

