avrxml/asf/thirdparty/atmel_rf4ce/lib/inc/atmega128rfa1.h
/** Offset for register DRTRAM1
 */
#define RG_DRTRAM1                       (0x134)
  /** Access parameters for sub-register DRTRAM1_DRTMN in register @ref RG_DRTRAM1
   */
#define SR_DRTRAM1_DRTMN             0x134, 0x03, 0
  /** Access parameters for sub-register DRTRAM1_DRTMP in register @ref RG_DRTRAM1
   */
#define SR_DRTRAM1_DRTMP             0x134, 0x0c, 2
  /** Access parameters for sub-register DRTRAM1_ENDRT in register @ref RG_DRTRAM1
   */
#define SR_DRTRAM1_ENDRT             0x134, 0x10, 4
  /** Access parameters for sub-register DRTRAM1_DRTSWOK in register @ref RG_DRTRAM1
   */
#define SR_DRTRAM1_DRTSWOK           0x134, 0x20, 5

/** Offset for register DRTRAM0
 */
#define RG_DRTRAM0                       (0x135)
  /** Access parameters for sub-register DRTRAM0_DRTMN in register @ref RG_DRTRAM0
   */
#define SR_DRTRAM0_DRTMN             0x135, 0x03, 0
  /** Access parameters for sub-register DRTRAM0_DRTMP in register @ref RG_DRTRAM0
   */
#define SR_DRTRAM0_DRTMP             0x135, 0x0c, 2
  /** Access parameters for sub-register DRTRAM0_ENDRT in register @ref RG_DRTRAM0
   */
#define SR_DRTRAM0_ENDRT             0x135, 0x10, 4
  /** Access parameters for sub-register DRTRAM0_DRTSWOK in register @ref RG_DRTRAM0
   */
#define SR_DRTRAM0_DRTSWOK           0x135, 0x20, 5

/** Offset for register DPDS0
 */
#define RG_DPDS0                         (0x136)
  /** Access parameters for sub-register PBDRV in register @ref RG_DPDS0
   */
#define SR_PBDRV                     0x136, 0x03, 0
  /** Access parameters for sub-register PDDRV in register @ref RG_DPDS0
   */
#define SR_PDDRV                     0x136, 0x0c, 2
  /** Access parameters for sub-register PEDRV in register @ref RG_DPDS0
   */
#define SR_PEDRV                     0x136, 0x30, 4
  /** Access parameters for sub-register PFDRV in register @ref RG_DPDS0
   */
#define SR_PFDRV                     0x136, 0xc0, 6

/** Offset for register DPDS1
 */
#define RG_DPDS1                         (0x137)
  /** Access parameters for sub-register PGDRV in register @ref RG_DPDS1
   */
#define SR_PGDRV                     0x137, 0x03, 0

/** Offset for register TRXPR
 */
#define RG_TRXPR                         (0x139)
  /** Access parameters for sub-register TRXRST in register @ref RG_TRXPR
   */
#define SR_TRXRST                    0x139, 0x01, 0
  /** Access parameters for sub-register SLPTR in register @ref RG_TRXPR
   */
#define SR_SLPTR                     0x139, 0x02, 1
#define SR_TRXTST                    0x139, 0x04, 2
  /** Access parameters for sub-register ATBE in register @ref RG_TRXPR
   */
#define SR_ATBE                      0x139, 0x08, 3

/** Offset for register AES_TEST
 */
#define RG_AES_TEST                      (0x13b)
  /** Access parameters for sub-register AES_OK in register @ref RG_AES_TEST
   */
#define SR_AES_OK                    0x13b, 0x01, 0
  /** Access parameters for sub-register AES_DONE in register @ref RG_AES_TEST
   */
#define SR_AES_DONE                  0x13b, 0x02, 1
  /** Access parameters for sub-register AES_TR in register @ref RG_AES_TEST
   */
#define SR_AES_TR                    0x13b, 0x80, 7

/** Offset for register AES_CTRL
 */
#define RG_AES_CTRL                       (0x13c)
  /** Access parameters for sub-register AES_IM in register @ref RG_AES_CTRL
   */
#define SR_AES_IM                    0x13c, 0x04, 2
  /** Access parameters for sub-register AES_DIR in register @ref RG_AES_CTRL
   */
#define SR_AES_DIR                   0x13c, 0x08, 3
  /** Access parameters for sub-register AES_MODE in register @ref RG_AES_CTRL
   */
#define SR_AES_MODE                  0x13c, 0x20, 5
  /** Access parameters for sub-register AES_REQUEST in register @ref RG_AES_CTRL
   */
#define SR_AES_REQUEST               0x13c, 0x80, 7

/** Offset for register AES_STATUS
 */
#define RG_AES_STATUS                        (0x13d)
  /** Access parameters for sub-register AES_RY in register @ref RG_AES_STATUS
   */
#define SR_AES_RY                    0x13d, 0x01, 0
  /** Access parameters for sub-register AES_ER in register @ref RG_AES_STATUS
   */
#define SR_AES_ER                    0x13d, 0x80, 7

/** Offset for register AES_STATE
 */
#define RG_AES_STATE                     (0x13e)
  /** Access parameters for sub-register AES_STATE in register @ref RG_AES_STATE
   */
#define SR_AES_STATE                 0x13e, 0xff, 0

/** Offset for register AES_KEY
 */
#define RG_AES_KEY                       (0x13f)
  /** Access parameters for sub-register AES_KEY in register @ref RG_AES_KEY
   */
#define SR_AES_KEY                   0x13f, 0xff, 0

/** Offset for register TRX_STATUS
 */
#define RG_TRX_STATUS                    (0x141)
  /** Access parameters for sub-register TRX_STATUS in register @ref RG_TRX_STATUS
   */
#define SR_TRX_STATUS                0x141, 0x1f, 0
   /** Constant P_ON for sub-register @ref SR_TRX_STATUS
    */

#undef P_ON
#undef BUSY_RX
#undef BUSY_TX
#undef RX_ON
#undef TRX_OFF
#undef PLL_ON
#undef TRX_SLEEP
#undef BUSY_RX_AACK
#undef BUSY_TX_ARET
#undef RX_AACK_ON
#undef TX_ARET_ON
#undef RX_ON_NOCLK
#undef RX_AACK_ON_NOCLK
#undef BUSY_RX_AACK_NOCLK
#undef STATE_TRANSITION_IN_PROGRESS

/** Transceiver states */
typedef enum tal_trx_status_tag
{
    /** Constant P_ON for sub-register SR_TRX_STATUS */
    P_ON                            = (0),

    /** Constant BUSY_RX for sub-register SR_TRX_STATUS */
    BUSY_RX                         = (1),

    /** Constant BUSY_TX for sub-register SR_TRX_STATUS */
    BUSY_TX                         = (2),

    /** Constant RX_ON for sub-register SR_TRX_STATUS */
    RX_ON                           = (6),

    /** Constant TRX_OFF for sub-register SR_TRX_STATUS */
    TRX_OFF                         = (8),

    /** Constant PLL_ON for sub-register SR_TRX_STATUS */
    PLL_ON                          = (9),

    /** Constant SLEEP for sub-register SR_TRX_STATUS */
    TRX_SLEEP                       = (15),

    /** Constant BUSY_RX_AACK for sub-register SR_TRX_STATUS */
    BUSY_RX_AACK                    = (17),

    /** Constant BUSY_TX_ARET for sub-register SR_TRX_STATUS */
    BUSY_TX_ARET                    = (18),

    /** Constant RX_AACK_ON for sub-register SR_TRX_STATUS */
    RX_AACK_ON                      = (22),

