avrxml/asf/thirdparty/atmel_rf4ce/lib/inc/atmega128rfa1.h
    /** Constant TX_ARET_ON for sub-register SR_TRX_STATUS */
    TX_ARET_ON                      = (25),

    /** Constant RX_ON_NOCLK for sub-register SR_TRX_STATUS */
    RX_ON_NOCLK                     = (28),

    /** Constant RX_AACK_ON_NOCLK for sub-register SR_TRX_STATUS */
    RX_AACK_ON_NOCLK                = (29),

    /** Constant BUSY_RX_AACK_NOCLK for sub-register SR_TRX_STATUS */
    BUSY_RX_AACK_NOCLK              = (30),

    /** Constant STATE_TRANSITION_IN_PROGRESS for sub-register SR_TRX_STATUS */
    STATE_TRANSITION_IN_PROGRESS    = (31)
} SHORTENUM tal_trx_status_t;

#define SR_TST_STATUS                0x141, 0x20, 5
#define TST_STATUS_TEST_MODE_IS_DISABLED    (0)
#define TST_STATUS_TEST_MODE_IS_ACTIVE      (1)
  /** Access parameters for sub-register CCA_STATUS in register @ref RG_TRX_STATUS
   */
#define SR_CCA_STATUS                0x141, 0x40, 6
   /** Constant CCA_STATUS_CHANNEL_IS_BUSY for sub-register @ref SR_CCA_STATUS
    */
#define CCA_STATUS_CHANNEL_IS_BUSY (0)
   /** Constant CCA_STATUS_CHANNEL_IS_IDLE for sub-register @ref SR_CCA_STATUS
    */
#define CCA_STATUS_CHANNEL_IS_IDLE (1)
  /** Access parameters for sub-register CCA_DONE in register @ref RG_TRX_STATUS
   */
#define SR_CCA_DONE                  0x141, 0x80, 7
   /** Constant CCA_CALCULATION_NOT_FINISHED for sub-register @ref SR_CCA_DONE
    */
#define CCA_CALCULATION_NOT_FINISHED (0)
   /** Constant CCA_CALCULATION_DONE for sub-register @ref SR_CCA_DONE
    */
#define CCA_CALCULATION_DONE     (1)

/** Offset for register TRX_STATE
 */
#define RG_TRX_STATE                     (0x142)
  /** Access parameters for sub-register TRX_CMD in register @ref RG_TRX_STATE
   */
#define SR_TRX_CMD                   0x142, 0x1f, 0

#undef CMD_NOP
#undef CMD_TX_START
#undef CMD_FORCE_TRX_OFF
#undef CMD_FORCE_PLL_ON
#undef CMD_RX_ON
#undef CMD_TRX_OFF
#undef CMD_PLL_ON
#undef CMD_SLEEP
#undef CMD_RX_AACK_ON
#undef CMD_TX_ARET_ON

/** Transceiver commands */
typedef enum trx_cmd_tag
{
    /** Constant CMD_NOP for sub-register SR_TRX_CMD */
    CMD_NOP                         = (0),

    /** Constant CMD_TX_START for sub-register SR_TRX_CMD */
    CMD_TX_START                    = (2),

    /** Constant CMD_FORCE_TRX_OFF for sub-register SR_TRX_CMD */
    CMD_FORCE_TRX_OFF               = (3),

    /** Constant CMD_FORCE_PLL_ON for sub-register SR_TRX_CMD */
    CMD_FORCE_PLL_ON                = (4),

    /** Constant CMD_RX_ON for sub-register SR_TRX_CMD */
    CMD_RX_ON                       = (6),

    /** Constant CMD_TRX_OFF for sub-register SR_TRX_CMD */
    CMD_TRX_OFF                     = (8),

    /** Constant CMD_PLL_ON for sub-register SR_TRX_CMD */
    CMD_PLL_ON                      = (9),

    /** Software implemented command */
    CMD_SLEEP                       = (15),

    /** Constant CMD_RX_AACK_ON for sub-register SR_TRX_CMD */
    CMD_RX_AACK_ON                  = (22),

    /** Constant CMD_TX_ARET_ON for sub-register SR_TRX_CMD */
    CMD_TX_ARET_ON                  = (25)
} SHORTENUM trx_cmd_t;

#define SR_TRAC_STATUS               0x142, 0xe0, 5

#undef TRAC_SUCCESS
#undef TRAC_SUCCESS_DATA_PENDING
#undef TRAC_WAIT_FOR_ACK
#undef TRAC_CHANNEL_ACCESS_FAILURE
#undef TRAC_NO_ACK
#undef TRAC_INVALID

/** Transceiver's trac status */
typedef enum trx_trac_status_tag
{
    TRAC_SUCCESS = 0,
    TRAC_SUCCESS_DATA_PENDING = 1,
    TRAC_WAIT_FOR_ACK = 2,
    TRAC_CHANNEL_ACCESS_FAILURE = 3,
    TRAC_NO_ACK = 5,
    TRAC_INVALID = 7
} SHORTENUM trx_trac_status_t;

/** Offset for register TRX_CTRL_0
 */
#define RG_TRX_CTRL_0                    (0x143)
  /** Access parameters for sub-register CLKM_CTRL in register @ref RG_TRX_CTRL_0
   */
#define SR_CLKM_CTRL                 0x143, 0x07, 0
   /** Constant CLKM_NO_CLOCK for sub-register @ref SR_CLKM_CTRL
    */
#define CLKM_NO_CLOCK            (0)
   /** Constant CLKM_1MHz for sub-register @ref SR_CLKM_CTRL
    */
#define CLKM_1MHz                (1)
   /** Constant CLKM_2MHz for sub-register @ref SR_CLKM_CTRL
    */
#define CLKM_2MHz                (2)
   /** Constant CLKM_4MHz for sub-register @ref SR_CLKM_CTRL
    */
#define CLKM_4MHz                (3)
   /** Constant CLKM_8MHz for sub-register @ref SR_CLKM_CTRL
    */
#define CLKM_8MHz                (4)
   /** Constant CLKM_16MHz for sub-register @ref SR_CLKM_CTRL
    */
#define CLKM_16MHz               (5)
   /** Constant CLKM_1_4MHz for sub-register @ref SR_CLKM_CTRL
    */
#define CLKM_1_4MHz              (6)
   /** Constant CLKM_1_16MHz for sub-register @ref SR_CLKM_CTRL
    */
#define CLKM_1_16MHz             (7)
  /** Access parameters for sub-register CLKM_SHA_SEL in register @ref RG_TRX_CTRL_0
   */
#define SR_CLKM_SHA_SEL              0x143, 0x08, 3
   /** Constant CLKM_SHA_DISABLE for sub-register @ref SR_CLKM_SHA_SEL
    */
#define CLKM_SHA_DISABLE         (0)
   /** Constant CLKM_SHA_ENABLE for sub-register @ref SR_CLKM_SHA_SEL
    */
#define CLKM_SHA_ENABLE          (1)
  /** Access parameters for sub-register PAD_IO_CLKM in register @ref RG_TRX_CTRL_0
   */
#define SR_PAD_IO_CLKM               0x143, 0x30, 4
   /** Constant PAD_CLKM_2mA for sub-register @ref SR_PAD_IO_CLKM
    */
#define PAD_CLKM_2mA             (0)
   /** Constant PAD_CLKM_4mA for sub-register @ref SR_PAD_IO_CLKM
    */
#define PAD_CLKM_4mA             (1)
   /** Constant PAD_CLKM_6mA for sub-register @ref SR_PAD_IO_CLKM
    */
#define PAD_CLKM_6mA             (2)
   /** Constant PAD_CLKM_8mA for sub-register @ref SR_PAD_IO_CLKM
    */
#define PAD_CLKM_8mA             (3)
  /** Access parameters for sub-register PAD_IO in register @ref RG_TRX_CTRL_0
   */
#define SR_PAD_IO                    0x143, 0xc0, 6
   /** Constant PAD_IO_2mA for sub-register @ref SR_PAD_IO
    */
#define PAD_IO_2mA               (0)
   /** Constant PAD_IO_4mA for sub-register @ref SR_PAD_IO
    */
#define PAD_IO_4mA               (1)
   /** Constant PAD_IO_6mA for sub-register @ref SR_PAD_IO
    */
#define PAD_IO_6mA               (2)
   /** Constant PAD_IO_8mA for sub-register @ref SR_PAD_IO
    */
#define PAD_IO_8mA               (3)

/** Offset for register TRX_CTRL_1
 */
#define RG_TRX_CTRL_1                    (0x144)
  /** Access parameters for sub-register IRQ_POLARITY in register @ref RG_TRX_CTRL_1
   */
#define SR_IRQ_POLARITY              0x144, 0x01, 0
   /** Constant IRQ_POL_HIGH_ACTIVE_IRQ for sub-register @ref SR_IRQ_POLARITY
    */
#define IRQ_POL_HIGH_ACTIVE_IRQ  (0)
   /** Constant IRQ_POL_LOW_ACTIVE_IRQ for sub-register @ref SR_IRQ_POLARITY
    */
#define IRQ_POL_LOW_ACTIVE_IRQ   (1)
  /** Access parameters for sub-register IRQ_MASK_MODE in register @ref RG_TRX_CTRL_1
   */
#define SR_IRQ_MASK_MODE             0x144, 0x02, 1
   /** Constant IRQ_MASK_MODE_OFF for sub-register @ref SR_IRQ_MASK_MODE
    */
#define IRQ_MASK_MODE_OFF        (0)
   /** Constant IRQ_MASK_MODE_ON for sub-register @ref SR_IRQ_MASK_MODE
    */
#define IRQ_MASK_MODE_ON         (1)
  /** Access parameters for sub-register SPI_CMD_MODE in register @ref RG_TRX_CTRL_1
   */
#define SR_SPI_CMD_MODE              0x144, 0x0c, 2
   /** Constant SPI_CMD_MODE_DEFAULT for sub-register @ref SR_SPI_CMD_MODE
    */
#define SPI_CMD_MODE_DEFAULT     (0)
   /** Constant SPI_CMD_MODE_MONITOR_TRX_STATUS for sub-register @ref SR_SPI_CMD_MODE
    */
#define SPI_CMD_MODE_MONITOR_TRX_STATUS (1)
   /** Constant SPI_CMD_MODE_MONITOR_PHY_RSSI for sub-register @ref SR_SPI_CMD_MODE
    */
#define SPI_CMD_MODE_MONITOR_PHY_RSSI (2)
   /** Constant SPI_CMD_MODE_MONITOR_IRQ_STATUS for sub-register @ref SR_SPI_CMD_MODE
    */
#define SPI_CMD_MODE_MONITOR_IRQ_STATUS (3)
  /** Access parameters for sub-register RX_BL_CTRL in register @ref RG_TRX_CTRL_1
   */
#define SR_RX_BL_CTRL                0x144, 0x10, 4
  /** Access parameters for sub-register TX_AUTO_CRC_ON in register @ref RG_TRX_CTRL_1
   */
#define SR_TX_AUTO_CRC_ON            0x144, 0x20, 5
  /** Access parameters for sub-register IRQ_2_EXT_EN in register @ref RG_TRX_CTRL_1
   */
/** Constant TX_AUTO_CRC_ENABLE for sub-register TX_AUTO_CRC_ON in register RG_TRX_CTRL_1 */
#define TX_AUTO_CRC_DISABLE   (0)

