avrxml/asf/thirdparty/atmel_rf4ce/lib/inc/atmega128rfa1.h
/** Constant TX_AUTO_CRC_ENABLE for sub-register TX_AUTO_CRC_ON in register RG_TRX_CTRL_1 */
#define TX_AUTO_CRC_ENABLE   (1)

#define SR_IRQ_2_EXT_EN              0x144, 0x40, 6
  /** Access parameters for sub-register PA_EXT_EN in register @ref RG_TRX_CTRL_1
   */
#define SR_PA_EXT_EN                 0x144, 0x80, 7

/** Offset for register PHY_TX_PWR
 */
#define RG_PHY_TX_PWR                    (0x145)
  /** Access parameters for sub-register TX_PWR in register @ref RG_PHY_TX_PWR
   */
#define SR_TX_PWR                    0x145, 0x0f, 0
   /** Constant _3_2dBm for sub-register @ref SR_TX_PWR
    */
#define _3_2dBm                  (0)
   /** Constant _2_8dBm for sub-register @ref SR_TX_PWR
    */
#define _2_8dBm                  (1)
   /** Constant _2_3dBm for sub-register @ref SR_TX_PWR
    */
#define _2_3dBm                  (2)
   /** Constant _1_8dBm for sub-register @ref SR_TX_PWR
    */
#define _1_8dBm                  (3)
   /** Constant _1_3dBm for sub-register @ref SR_TX_PWR
    */
#define _1_3dBm                  (4)
   /** Constant _0_7dBm for sub-register @ref SR_TX_PWR
    */
#define _0_7dBm                  (5)
   /** Constant _0_0dBm for sub-register @ref SR_TX_PWR
    */
#define _0_0dBm                  (6)
   /** Constant __1dBm for sub-register @ref SR_TX_PWR
    */
#define __1dBm                   (7)
   /** Constant __2dBm for sub-register @ref SR_TX_PWR
    */
#define __2dBm                   (8)
   /** Constant __3dBm for sub-register @ref SR_TX_PWR
    */
#define __3dBm                   (9)
   /** Constant __4dBm for sub-register @ref SR_TX_PWR
    */
#define __4dBm                   (10)
   /** Constant __5dBm for sub-register @ref SR_TX_PWR
    */
#define __5dBm                   (11)
   /** Constant __7dBm for sub-register @ref SR_TX_PWR
    */
#define __7dBm                   (12)
   /** Constant __9dBm for sub-register @ref SR_TX_PWR
    */
#define __9dBm                   (13)
   /** Constant __12dBm for sub-register @ref SR_TX_PWR
    */
#define __12dBm                  (14)
   /** Constant __17dBm for sub-register @ref SR_TX_PWR
    */
#define __17dBm                  (15)
  /** Access parameters for sub-register PA_LT in register @ref RG_PHY_TX_PWR
   */
#define SR_PA_LT                     0x145, 0x30, 4
   /** Constant PA_LT_2us for sub-register @ref SR_PA_LT
    */
#define PA_LT_2us                (0)
   /** Constant PA_LT_4us for sub-register @ref SR_PA_LT
    */
#define PA_LT_4us                (1)
   /** Constant PA_LT_6us for sub-register @ref SR_PA_LT
    */
#define PA_LT_6us                (2)
   /** Constant PA_LT_8us for sub-register @ref SR_PA_LT
    */
#define PA_LT_8us                (3)
  /** Access parameters for sub-register PA_BUF_LT in register @ref RG_PHY_TX_PWR
   */
#define SR_PA_BUF_LT                 0x145, 0xc0, 6
   /** Constant PA_BUF_LT_0us for sub-register @ref SR_PA_BUF_LT
    */
#define PA_BUF_LT_0us            (0)
   /** Constant PA_BUF_LT_2us for sub-register @ref SR_PA_BUF_LT
    */
#define PA_BUF_LT_2us            (1)
   /** Constant PA_BUF_LT_4us for sub-register @ref SR_PA_BUF_LT
    */
#define PA_BUF_LT_4us            (2)
   /** Constant PA_BUF_LT_6us for sub-register @ref SR_PA_BUF_LT
    */
#define PA_BUF_LT_6us            (3)

/** Offset for register PHY_RSSI
 */
#define RG_PHY_RSSI                      (0x146)
  /** Access parameters for sub-register RSSI in register @ref RG_PHY_RSSI
   */
#define SR_RSSI                      0x146, 0x1f, 0
  /** Access parameters for sub-register RND_VALUE in register @ref RG_PHY_RSSI
   */
#define SR_RND_VALUE                 0x146, 0x60, 5
  /** Access parameters for sub-register RX_CRC_VALID in register @ref RG_PHY_RSSI
   */
#define SR_RX_CRC_VALID              0x146, 0x80, 7
   /** Constant CRC16_NOT_VALID for sub-register @ref SR_RX_CRC_VALID
    */
#define CRC16_NOT_VALID          (0)
   /** Constant CRC16_VALID for sub-register @ref SR_RX_CRC_VALID
    */
#define CRC16_VALID              (1)

/** Offset for register PHY_ED_LEVEL
 */
#define RG_PHY_ED_LEVEL                  (0x147)

/** Offset for register PHY_CC_CCA
 */
#define RG_PHY_CC_CCA                    (0x148)
  /** Access parameters for sub-register CHANNEL in register @ref RG_PHY_CC_CCA
   */
#define SR_CHANNEL                   0x148, 0x1f, 0
   /** Constant _2405MHz for sub-register @ref SR_CHANNEL
    */
#define _2405MHz                 (11)
   /** Constant _2410MHz for sub-register @ref SR_CHANNEL
    */
#define _2410MHz                 (12)
   /** Constant _2415MHz for sub-register @ref SR_CHANNEL
    */
#define _2415MHz                 (13)
   /** Constant _2420MHz for sub-register @ref SR_CHANNEL
    */
#define _2420MHz                 (14)
   /** Constant _2425MHz for sub-register @ref SR_CHANNEL
    */
#define _2425MHz                 (15)
   /** Constant _2430MHz for sub-register @ref SR_CHANNEL
    */
#define _2430MHz                 (16)
   /** Constant _2435MHz for sub-register @ref SR_CHANNEL
    */
#define _2435MHz                 (17)
   /** Constant _2440MHz for sub-register @ref SR_CHANNEL
    */
#define _2440MHz                 (18)
   /** Constant _2445MHz for sub-register @ref SR_CHANNEL
    */
#define _2445MHz                 (19)
   /** Constant _2450MHz for sub-register @ref SR_CHANNEL
    */
#define _2450MHz                 (20)
   /** Constant _2455MHz for sub-register @ref SR_CHANNEL
    */
#define _2455MHz                 (21)
   /** Constant _2460MHz for sub-register @ref SR_CHANNEL
    */
#define _2460MHz                 (22)
   /** Constant _2465MHz for sub-register @ref SR_CHANNEL
    */
#define _2465MHz                 (23)
   /** Constant _2470MHz for sub-register @ref SR_CHANNEL
    */
#define _2470MHz                 (24)
   /** Constant _2475MHz for sub-register @ref SR_CHANNEL
    */
#define _2475MHz                 (25)
   /** Constant _2480MHz for sub-register @ref SR_CHANNEL
    */
#define _2480MHz                 (26)
  /** Access parameters for sub-register CCA_MODE in register @ref RG_PHY_CC_CCA
   */
#define SR_CCA_MODE                  0x148, 0x60, 5
   /** Constant CCA_Mode_0 for sub-register @ref SR_CCA_MODE
    */
#define CCA_Mode_0               (0)
   /** Constant CCA_Mode_1 for sub-register @ref SR_CCA_MODE
    */
#define CCA_Mode_1               (1)
   /** Constant CCA_Mode_2 for sub-register @ref SR_CCA_MODE
    */
#define CCA_Mode_2               (2)
   /** Constant CCA_Mode_3 for sub-register @ref SR_CCA_MODE
    */
#define CCA_Mode_3               (3)
  /** Access parameters for sub-register CCA_REQUEST in register @ref RG_PHY_CC_CCA
   */
#define SR_CCA_REQUEST               0x148, 0x80, 7

/** Constant CCA_START for sub-register CCA_REQUEST in register RG_PHY_CC_CCA */
#define CCA_START               (1)


/** Offset for register CCA_THRES
 */
#define RG_CCA_THRES                     (0x149)
  /** Access parameters for sub-register CCA_ED_THRES in register @ref RG_CCA_THRES
   */
#define SR_CCA_ED_THRES              0x149, 0x0f, 0
   /** Constant RSSI_BASE_VAL_00dB for sub-register @ref SR_CCA_ED_THRES
    */
#define RSSI_BASE_VAL_00dB       (0)
   /** Constant RSSI_BASE_VAL_02dB for sub-register @ref SR_CCA_ED_THRES
    */
#define RSSI_BASE_VAL_02dB       (1)
   /** Constant RSSI_BASE_VAL_04dB for sub-register @ref SR_CCA_ED_THRES
    */
#define RSSI_BASE_VAL_04dB       (2)
   /** Constant RSSI_BASE_VAL_06dB for sub-register @ref SR_CCA_ED_THRES
    */
#define RSSI_BASE_VAL_06dB       (3)
   /** Constant RSSI_BASE_VAL_08dB for sub-register @ref SR_CCA_ED_THRES
    */
#define RSSI_BASE_VAL_08dB       (4)
   /** Constant RSSI_BASE_VAL_10dB for sub-register @ref SR_CCA_ED_THRES
    */
#define RSSI_BASE_VAL_10dB       (5)
   /** Constant RSSI_BASE_VAL_12dB for sub-register @ref SR_CCA_ED_THRES
    */
#define RSSI_BASE_VAL_12dB       (6)
   /** Constant RSSI_BASE_VAL_14dB for sub-register @ref SR_CCA_ED_THRES
    */
#define RSSI_BASE_VAL_14dB       (7)
   /** Constant RSSI_BASE_VAL_16dB for sub-register @ref SR_CCA_ED_THRES
    */
#define RSSI_BASE_VAL_16dB       (8)
   /** Constant RSSI_BASE_VAL_18dB for sub-register @ref SR_CCA_ED_THRES
    */
#define RSSI_BASE_VAL_18dB       (9)
   /** Constant RSSI_BASE_VAL_20dB for sub-register @ref SR_CCA_ED_THRES
    */
#define RSSI_BASE_VAL_20dB       (10)
   /** Constant RSSI_BASE_VAL_22dB for sub-register @ref SR_CCA_ED_THRES
    */
#define RSSI_BASE_VAL_22dB       (11)
   /** Constant RSSI_BASE_VAL_24dB for sub-register @ref SR_CCA_ED_THRES
    */
#define RSSI_BASE_VAL_24dB       (12)
   /** Constant RSSI_BASE_VAL_26dB for sub-register @ref SR_CCA_ED_THRES
    */
#define RSSI_BASE_VAL_26dB       (13)
   /** Constant RSSI_BASE_VAL_28dB for sub-register @ref SR_CCA_ED_THRES
    */
#define RSSI_BASE_VAL_28dB       (14)
   /** Constant RSSI_BASE_VAL_30dB for sub-register @ref SR_CCA_ED_THRES
    */
#define RSSI_BASE_VAL_30dB       (15)
  /** Access parameters for sub-register CCA_CS_THRES in register @ref RG_CCA_THRES
   */
#define SR_CCA_CS_THRES              0x149, 0xf0, 4

/** Offset for register RX_CTRL
 */
#define RG_RX_CTRL                       (0x14a)
  /** Access parameters for sub-register PDT_THRES in register @ref RG_RX_CTRL
   */
#define SR_PDT_THRES                 0x14a, 0x0f, 0
  /** Access parameters for sub-register SOFT_MODE in register @ref RG_RX_CTRL
   */
/** Constant THRES_ANT_DIV_ENABLE for sub-register SR_PDT_THRES in register RG_RX_CTRL */
#define THRES_ANT_DIV_ENABLE        (0x3)

/** Constant THRES_ANT_DIV_DISABLED for sub-register SR_PDT_THRES in register RG_RX_CTRL */
#define THRES_ANT_DIV_DISABLED       (0x7)

#define SR_SOFT_MODE                 0x14a, 0x10, 4
   /** Constant SOFT_MODE_DISABLE for sub-register @ref SR_SOFT_MODE
    */
#define SOFT_MODE_DISABLE        (0)
   /** Constant SOFT_MODE_ENABLE for sub-register @ref SR_SOFT_MODE
    */
#define SOFT_MODE_ENABLE         (1)
  /** Access parameters for sub-register ACR_MODE in register @ref RG_RX_CTRL
   */
#define SR_ACR_MODE                  0x14a, 0x20, 5
   /** Constant ACR_DISABLE for sub-register @ref SR_ACR_MODE
    */
#define ACR_DISABLE              (0)
   /** Constant ACR_ENABLE for sub-register @ref SR_ACR_MODE
    */
#define ACR_ENABLE               (1)
  /** Access parameters for sub-register SDM_MODE in register @ref RG_RX_CTRL
   */
#define SR_SDM_MODE                  0x14a, 0xc0, 6
   /** Constant X_SELECT_SDM1_DCU_ON for sub-register @ref SR_SDM_MODE
    */
#define X_SELECT_SDM1_DCU_ON     (0)
   /** Constant X_SELECT_SDM2_DCU_OFF for sub-register @ref SR_SDM_MODE
    */
#define X_SELECT_SDM2_DCU_OFF    (1)
   /** Constant X_SELECT_SDM2_DCU_ON for sub-register @ref SR_SDM_MODE
    */
#define X_SELECT_SDM2_DCU_ON     (2)
   /** Constant X_SELECT_SDM3_DCU_OFF for sub-register @ref SR_SDM_MODE
    */
#define X_SELECT_SDM3_DCU_OFF    (3)

/** Offset for register SFD_VALUE
 */
#define RG_SFD_VALUE                     (0x14b)
  /** Access parameters for sub-register SFD_VALUE in register @ref RG_SFD_VALUE
   */
#define SR_SFD_VALUE                 0x14b, 0xff, 0

/** Offset for register TRX_CTRL_2
 */
#define RG_TRX_CTRL_2                    (0x14c)
  /** Access parameters for sub-register OQPSK_DATA_RATE in register @ref RG_TRX_CTRL_2
   */
#define SR_OQPSK_DATA_RATE           0x14c, 0x03, 0
   /** Constant ALTRATE_250KBPS for sub-register @ref SR_OQPSK_DATA_RATE
    */
#define ALTRATE_250KBPS         (0)
   /** Constant ALTRATE_500KBPS for sub-register @ref SR_OQPSK_DATA_RATE
    */
#define ALTRATE_500KBPS         (1)
   /** Constant ALTRATE_1MBPS for sub-register @ref SR_OQPSK_DATA_RATE
    */
#define ALTRATE_1MBPS           (2)
   /** Constant ALTRATE_2MBPS for sub-register @ref SR_OQPSK_DATA_RATE
    */
#define ALTRATE_2MBPS           (3)
  /** Access parameters for sub-register RX_SAFE_MODE in register @ref RG_TRX_CTRL_2
   */
#define SR_RX_SAFE_MODE              0x14c, 0x80, 7

/** Constant RX_SAFE_MODE_DISABLE for sub-register RX_SAFE_MODE in register RG_TRX_CTRL_2 */
#define RX_SAFE_MODE_DISABLE     (0)

