avrxml/asf/thirdparty/atmel_rf4ce/lib/inc/atmega128rfa1.h
/** Constant RX_SAFE_MODE_ENABLE for sub-register RX_SAFE_MODE in register RG_TRX_CTRL_2 */
#define RX_SAFE_MODE_ENABLE     (1)

/** Offset for register ANT_DIV
 */
#define RG_ANT_DIV                       (0x14d)
  /** Access parameters for sub-register ANT_CTRL in register @ref RG_ANT_DIV
   */
#define SR_ANT_CTRL                  0x14d, 0x03, 0
   /** Constant NOT_ALLOWED for sub-register @ref SR_ANT_CTRL
    */
#define NOT_ALLOWED              (0)
   /** Constant RFN_ANT_EXT_SW_EN_0_ for sub-register @ref SR_ANT_CTRL
    */
#define RFN_ANT_EXT_SW_EN_0_     (1)
   /** Constant DIG1_2_ANT_EXT_SW_EN_1_ for sub-register @ref SR_ANT_CTRL
    */
#define DIG1_2_ANT_EXT_SW_EN_1_  (1)
   /** Constant RFP_ANT_EXT_SW_EN_0_ for sub-register @ref SR_ANT_CTRL
    */
#define RFP_ANT_EXT_SW_EN_0_     (2)
   /** Constant ANT_DIV_ANT_CTRL_DIG1_2_ANT_EXT_SW_EN_1_0 for sub-register @ref SR_ANT_CTRL
    */
#define ANT_DIV_ANT_CTRL_DIG1_2_ANT_EXT_SW_EN_1_0 (2)
   /** Constant RFN_RFP_ANT_EXT_SW_EN_0_ for sub-register @ref SR_ANT_CTRL
    */
#define RFN_RFP_ANT_EXT_SW_EN_0_ (3)
   /** Constant NOT_ALLOWED_ANT_EXT_SW_EN_1_ for sub-register @ref SR_ANT_CTRL
    */
#define NOT_ALLOWED_ANT_EXT_SW_EN_1_ (3)
  /** Access parameters for sub-register ANT_EXT_SW_EN in register @ref RG_ANT_DIV
   */
/** Constant ENABLE_ANTENNA_0 for sub-register SR_ANT_CTRL in register RG_ANT_DIV */
#define ENABLE_ANTENNA_0        (2)

/** Constant ENABLE_ANTENNA_1 for sub-register SR_ANT_CTRL in register RG_ANT_DIV */
#define ENABLE_ANTENNA_1        (1)

/** Constant ENABLE_ANTENNA_X for sub-register SR_ANT_CTRL in register RG_ANT_DIV */
#define ENABLE_ANTENNA_X        (3)

#define SR_ANT_EXT_SW_EN             0x14d, 0x04, 2
   /** Constant ANT_EXT_SW_INTERNAL_SWITCH for sub-register @ref SR_ANT_EXT_SW_EN
    */
#define ANT_EXT_SW_INTERNAL_SWITCH (0)
   /** Constant ANT_EXT_SW_EXTERNAL_SWITCH for sub-register @ref SR_ANT_EXT_SW_EN
    */
#define ANT_EXT_SW_EXTERNAL_SWITCH (1)
  /** Access parameters for sub-register ANT_DIV_EN in register @ref RG_ANT_DIV
   */
/** Constant ANT_EXT_SW_SWITCH_DISABLE for sub-register SR_ANT_EXT_SW_EN */
#define ANT_EXT_SW_SWITCH_DISABLE   (0)

/** Constant ANT_EXT_SW_SWITCH_ENABLE for sub-register SR_ANT_EXT_SW_EN */
#define ANT_EXT_SW_SWITCH_ENABLE   (1)

#define SR_ANT_DIV_EN                0x14d, 0x08, 3
   /** Constant ANT_DIV_DISABLE for sub-register @ref SR_ANT_DIV_EN
    */
#define ANT_DIV_DISABLE          (0)
   /** Constant ANT_DIV_ENABLE for sub-register @ref SR_ANT_DIV_EN
    */
#define ANT_DIV_ENABLE           (1)
  /** Access parameters for sub-register ANT_SEL in register @ref RG_ANT_DIV
   */
#define SR_ANT_SEL                   0x14d, 0x80, 7
   /** Constant ANT_SEL_ANTENNA_0 for sub-register @ref SR_ANT_SEL
    */
#define ANT_SEL_ANTENNA_0        (0)
   /** Constant ANT_SEL_ANTENNA_1 for sub-register @ref SR_ANT_SEL
    */
#define ANT_SEL_ANTENNA_1        (1)

/** Offset for register IRQ_MASK
 */
#define RG_IRQ_MASK                      (0x14e)
  /** Access parameters for sub-register PLL_LOCK_EN in register @ref RG_IRQ_MASK
   */
#define SR_PLL_LOCK_EN               0x14e, 0x01, 0
  /** Access parameters for sub-register PLL_UNLOCK_EN in register @ref RG_IRQ_MASK
   */
#define SR_PLL_UNLOCK_EN             0x14e, 0x02, 1
  /** Access parameters for sub-register RX_START_EN in register @ref RG_IRQ_MASK
   */
#define SR_RX_START_EN               0x14e, 0x04, 2
  /** Access parameters for sub-register RX_END_EN in register @ref RG_IRQ_MASK
   */
#define SR_RX_END_EN                 0x14e, 0x08, 3
  /** Access parameters for sub-register CCA_ED_READY_EN in register @ref RG_IRQ_MASK
   */
#define SR_CCA_ED_READY_EN           0x14e, 0x10, 4
  /** Access parameters for sub-register AMI_EN in register @ref RG_IRQ_MASK
   */
#define SR_AMI_EN                    0x14e, 0x20, 5
  /** Access parameters for sub-register TX_END_EN in register @ref RG_IRQ_MASK
   */
#define SR_TX_END_EN                 0x14e, 0x40, 6
  /** Access parameters for sub-register AWAKE_EN in register @ref RG_IRQ_MASK
   */
#define SR_AWAKE_EN                  0x14e, 0x80, 7

/** Offset for register IRQ_STATUS
 */
#define RG_IRQ_STATUS                    (0x14f)
  /** Access parameters for sub-register PLL_LOCK in register @ref RG_IRQ_STATUS
   */
#define SR_PLL_LOCK                  0x14f, 0x01, 0
  /** Access parameters for sub-register PLL_UNLOCK in register @ref RG_IRQ_STATUS
   */
#define SR_PLL_UNLOCK                0x14f, 0x02, 1
  /** Access parameters for sub-register RX_START in register @ref RG_IRQ_STATUS
   */
#define SR_RX_START                  0x14f, 0x04, 2
  /** Access parameters for sub-register RX_END in register @ref RG_IRQ_STATUS
   */
#define SR_RX_END                    0x14f, 0x08, 3
  /** Access parameters for sub-register CCA_ED_READY in register @ref RG_IRQ_STATUS
   */
#define SR_CCA_ED_READY              0x14f, 0x10, 4
  /** Access parameters for sub-register AMI in register @ref RG_IRQ_STATUS
   */
#define SR_AMI                       0x14f, 0x20, 5
  /** Access parameters for sub-register TX_END in register @ref RG_IRQ_STATUS
   */
#define SR_TX_END                    0x14f, 0x40, 6
  /** Access parameters for sub-register AWAKE in register @ref RG_IRQ_STATUS
   */
#define SR_AWAKE                     0x14f, 0x80, 7

/** Offset for register VREG_CTRL
 */
#define RG_VREG_CTRL                     (0x150)
  /** Access parameters for sub-register DVREG_TRIM in register @ref RG_VREG_CTRL
   */
#define SR_DVREG_TRIM                0x150, 0x03, 0
  /** Access parameters for sub-register DVDD_OK in register @ref RG_VREG_CTRL
   */
#define SR_DVDD_OK                   0x150, 0x04, 2
  /** Access parameters for sub-register DVREG_EXT in register @ref RG_VREG_CTRL
   */
#define SR_DVREG_EXT                 0x150, 0x08, 3
  /** Access parameters for sub-register AVREG_TRIM in register @ref RG_VREG_CTRL
   */
#define SR_AVREG_TRIM                0x150, 0x30, 4
  /** Access parameters for sub-register AVDD_OK in register @ref RG_VREG_CTRL
   */
#define SR_AVDD_OK                   0x150, 0x40, 6
  /** Access parameters for sub-register AVREG_EXT in register @ref RG_VREG_CTRL
   */
#define SR_AVREG_EXT                 0x150, 0x80, 7

/** Offset for register BATMON
 */
#define RG_BATMON                        (0x151)
  /** Access parameters for sub-register BATMON_VTH in register @ref RG_BATMON
   */
#define SR_BATMON_VTH                0x151, 0x0f, 0
   /** Constant _2_550V_BATMON_HR_1_1_70V_BATMON_HR_0_ for sub-register @ref SR_BATMON_VTH
    */
#define _2_550V_BATMON_HR_1_1_70V_BATMON_HR_0_ (0)
   /** Constant _2_625V_BATMON_HR_1_1_75V_BATMON_HR_0_ for sub-register @ref SR_BATMON_VTH
    */
#define _2_625V_BATMON_HR_1_1_75V_BATMON_HR_0_ (1)
   /** Constant _2_700V_BATMON_HR_1_1_80V_BATMON_HR_0_ for sub-register @ref SR_BATMON_VTH
    */
#define _2_700V_BATMON_HR_1_1_80V_BATMON_HR_0_ (2)
   /** Constant _2_775V_BATMON_HR_1_1_85V_BATMON_HR_0_ for sub-register @ref SR_BATMON_VTH
    */
#define _2_775V_BATMON_HR_1_1_85V_BATMON_HR_0_ (3)
   /** Constant _2_850V_BATMON_HR_1_1_90V_BATMON_HR_0_ for sub-register @ref SR_BATMON_VTH
    */
#define _2_850V_BATMON_HR_1_1_90V_BATMON_HR_0_ (4)
   /** Constant _2_925V_BATMON_HR_1_1_95V_BATMON_HR_0_ for sub-register @ref SR_BATMON_VTH
    */
#define _2_925V_BATMON_HR_1_1_95V_BATMON_HR_0_ (5)
   /** Constant _3_000V_BATMON_HR_1_2_00V_BATMON_HR_0_ for sub-register @ref SR_BATMON_VTH
    */
#define _3_000V_BATMON_HR_1_2_00V_BATMON_HR_0_ (6)
   /** Constant _3_075V_BATMON_HR_1_2_05V_BATMON_HR_0_ for sub-register @ref SR_BATMON_VTH
    */
#define _3_075V_BATMON_HR_1_2_05V_BATMON_HR_0_ (7)
   /** Constant _3_150V_BATMON_HR_1_2_10V_BATMON_HR_0_ for sub-register @ref SR_BATMON_VTH
    */
#define _3_150V_BATMON_HR_1_2_10V_BATMON_HR_0_ (8)
   /** Constant _3_225V_BATMON_HR_1_2_15V_BATMON_HR_0_ for sub-register @ref SR_BATMON_VTH
    */
#define _3_225V_BATMON_HR_1_2_15V_BATMON_HR_0_ (9)
   /** Constant _3_300V_BATMON_HR_1_2_20V_BATMON_HR_0_ for sub-register @ref SR_BATMON_VTH
    */
#define _3_300V_BATMON_HR_1_2_20V_BATMON_HR_0_ (10)
   /** Constant _3_375V_BATMON_HR_1_2_25V_BATMON_HR_0_ for sub-register @ref SR_BATMON_VTH
    */
#define _3_375V_BATMON_HR_1_2_25V_BATMON_HR_0_ (11)
   /** Constant _3_450V_BATMON_HR_1_2_30V_BATMON_HR_0_ for sub-register @ref SR_BATMON_VTH
    */
#define _3_450V_BATMON_HR_1_2_30V_BATMON_HR_0_ (12)
   /** Constant _3_525V_BATMON_HR_1_2_35V_BATMON_HR_0_ for sub-register @ref SR_BATMON_VTH
    */
#define _3_525V_BATMON_HR_1_2_35V_BATMON_HR_0_ (13)
   /** Constant _3_600V_BATMON_HR_1_2_40V_BATMON_HR_0_ for sub-register @ref SR_BATMON_VTH
    */
#define _3_600V_BATMON_HR_1_2_40V_BATMON_HR_0_ (14)
   /** Constant _3_675V_BATMON_HR_1_2_45V_BATMON_HR_0_ for sub-register @ref SR_BATMON_VTH
    */
#define _3_675V_BATMON_HR_1_2_45V_BATMON_HR_0_ (15)
  /** Access parameters for sub-register BATMON_HR in register @ref RG_BATMON
   */
#define SR_BATMON_HR                 0x151, 0x10, 4
   /** Constant HIGH_RANGE_DISABLED for sub-register @ref SR_BATMON_HR
    */
#define HIGH_RANGE_DISABLED      (0)
   /** Constant HIGH_RANGE_ENABLED for sub-register @ref SR_BATMON_HR
    */
#define HIGH_RANGE_ENABLED       (1)
  /** Access parameters for sub-register BATMON_OK in register @ref RG_BATMON
   */
#define SR_BATMON_OK                 0x151, 0x20, 5
   /** Constant BATMON_NOT_VALID for sub-register @ref SR_BATMON_OK
    */
#define BATMON_NOT_VALID         (0)
   /** Constant BATMON_VALID for sub-register @ref SR_BATMON_OK
    */
#define BATMON_VALID             (1)
  /** Access parameters for sub-register BAT_LOW_EN in register @ref RG_BATMON
   */
#define SR_BAT_LOW_EN                0x151, 0x40, 6
   /** Constant BATTERY_IRQ_DISABLED for sub-register @ref SR_BAT_LOW_EN
    */
#define BATTERY_IRQ_DISABLED     (0)
   /** Constant BATTERY_IRQ_ENABLED for sub-register @ref SR_BAT_LOW_EN
    */
#define BATTERY_IRQ_ENABLED      (1)
  /** Access parameters for sub-register BAT_LOW in register @ref RG_BATMON
   */
#define SR_BAT_LOW                   0x151, 0x80, 7
   /** Constant BATTERY_NOT_LOW for sub-register @ref SR_BAT_LOW
    */
#define BATTERY_NOT_LOW          (0)
   /** Constant BATTERY_LOW for sub-register @ref SR_BAT_LOW
    */
#define BATTERY_LOW              (1)

