avrxml/asf/thirdparty/atmel_rf4ce/lib/inc/atmega128rfa1.h
/** Offset for register XOSC_CTRL
 */
#define RG_XOSC_CTRL                     (0x152)
  /** Access parameters for sub-register XTAL_TRIM in register @ref RG_XOSC_CTRL
   */
#define SR_XTAL_TRIM                 0x152, 0x0f, 0
   /** Constant _0_0pF for sub-register @ref SR_XTAL_TRIM
    */
#define _0_0pF                   (0)
   /** Constant _0_3pF for sub-register @ref SR_XTAL_TRIM
    */
#define _0_3pF                   (1)
   /** Constant _0_6pF for sub-register @ref SR_XTAL_TRIM
    */
#define _0_6pF                   (2)
   /** Constant _0_9pF for sub-register @ref SR_XTAL_TRIM
    */
#define _0_9pF                   (3)
   /** Constant _1_2pF for sub-register @ref SR_XTAL_TRIM
    */
#define _1_2pF                   (4)
   /** Constant _1_5pF for sub-register @ref SR_XTAL_TRIM
    */
#define _1_5pF                   (5)
   /** Constant _1_8pF for sub-register @ref SR_XTAL_TRIM
    */
#define _1_8pF                   (6)
   /** Constant _2_1pF for sub-register @ref SR_XTAL_TRIM
    */
#define _2_1pF                   (7)
   /** Constant _2_4pF for sub-register @ref SR_XTAL_TRIM
    */
#define _2_4pF                   (8)
   /** Constant _2_7pF for sub-register @ref SR_XTAL_TRIM
    */
#define _2_7pF                   (9)
   /** Constant _3_0pF for sub-register @ref SR_XTAL_TRIM
    */
#define _3_0pF                   (10)
   /** Constant _3_3pF for sub-register @ref SR_XTAL_TRIM
    */
#define _3_3pF                   (11)
   /** Constant _3_6pF for sub-register @ref SR_XTAL_TRIM
    */
#define _3_6pF                   (12)
   /** Constant _3_9pF for sub-register @ref SR_XTAL_TRIM
    */
#define _3_9pF                   (13)
   /** Constant _4_2pF for sub-register @ref SR_XTAL_TRIM
    */
#define _4_2pF                   (14)
   /** Constant _4_5pF for sub-register @ref SR_XTAL_TRIM
    */
#define _4_5pF                   (15)
  /** Access parameters for sub-register XTAL_MODE in register @ref RG_XOSC_CTRL
   */
#define SR_XTAL_MODE                 0x152, 0xf0, 4

/** Offset for register RX_SYN
 */
#define RG_RX_SYN                        (0x155)
  /** Access parameters for sub-register RX_PDT_LEVEL in register @ref RG_RX_SYN
   */
#define SR_RX_PDT_LEVEL              0x155, 0x0f, 0
  /** Access parameters for sub-register RX_PDT_DIS in register @ref RG_RX_SYN
   */
#define SR_RX_PDT_DIS                0x155, 0x80, 7

/** Minimum RSSI sensitivity value in dBm, which is equivalent to the value 0 in sub register SR_RSSI. */
#define RSSI_BASE_VAL_DBM   (-90)

   /** Constant RX_DISABLE for sub-register @ref SR_RX_PDT_DIS
    */
#define RX_DISABLE (1)
   /** Constant RX_ENABLE for sub-register @ref SR_RX_PDT_DIS
    */
#define RX_ENABLE (0)

/** Offset for register XAH_CTRL_1
 */
#define RG_XAH_CTRL_1                    (0x157)
  /** Access parameters for sub-register AACK_PROM_MODE in register @ref RG_XAH_CTRL_1
   */
#define SR_AACK_PROM_MODE            0x157, 0x02, 1
  /** Access parameters for sub-register AACK_ACK_TIME in register @ref RG_XAH_CTRL_1
   */
#define SR_AACK_ACK_TIME             0x157, 0x04, 2
   /** Constant AACK_ACK_TIME_12_SYMBOLS for sub-register @ref SR_AACK_ACK_TIME
    */
#define AACK_ACK_TIME_12_SYMBOLS (0)
   /** Constant AACK_ACK_TIME_2_SYMBOLS for sub-register @ref SR_AACK_ACK_TIME
    */
#define AACK_ACK_TIME_2_SYMBOLS  (1)
  /** Access parameters for sub-register AACK_UPLD_RES_FT in register @ref RG_XAH_CTRL_1
   */
#define SR_AACK_UPLD_RES_FT          0x157, 0x10, 4
  /** Access parameters for sub-register AACK_FLTR_RES_FT in register @ref RG_XAH_CTRL_1
   */
#define SR_AACK_FLTR_RES_FT          0x157, 0x20, 5

/** Offset for register FTN_CTRL
 */
#define RG_FTN_CTRL                      (0x158)
  /** Access parameters for sub-register FTNV in register @ref RG_FTN_CTRL
   */
#define SR_FTNV                      0x158, 0x3f, 0
  /** Access parameters for sub-register FTN_ROUND in register @ref RG_FTN_CTRL
   */
#define SR_FTN_ROUND                 0x158, 0x40, 6
  /** Access parameters for sub-register FTN_START in register @ref RG_FTN_CTRL
   */
#define SR_FTN_START                 0x158, 0x80, 7

/** Offset for register RF_CTRL
 */
#define RG_RF_CTRL                       (0x159)
  /** Access parameters for sub-register LNA_VF1 in register @ref RG_RF_CTRL
   */
#define SR_LNA_VF1                   0x159, 0x03, 0
  /** Access parameters for sub-register LNA_VF2 in register @ref RG_RF_CTRL
   */
#define SR_LNA_VF2                   0x159, 0x0c, 2
  /** Access parameters for sub-register PA_BUF_VF in register @ref RG_RF_CTRL
   */
#define SR_PA_BUF_VF                 0x159, 0x30, 4
  /** Access parameters for sub-register PLL_VCOB_VF in register @ref RG_RF_CTRL
   */
#define SR_PLL_VCOB_VF               0x159, 0xc0, 6

/** Offset for register PLL_CF
 */
#define RG_PLL_CF                        (0x15a)
  /** Access parameters for sub-register PLL_CF in register @ref RG_PLL_CF
   */
#define SR_PLL_CF                    0x15a, 0x0f, 0
  /** Access parameters for sub-register PLL_VMOD_TUNE in register @ref RG_PLL_CF
   */
#define SR_PLL_VMOD_TUNE             0x15a, 0x30, 4
  /** Access parameters for sub-register EN_PLL_CF in register @ref RG_PLL_CF
   */
#define SR_EN_PLL_CF                 0x15a, 0x40, 6
  /** Access parameters for sub-register PLL_CF_START in register @ref RG_PLL_CF
   */
#define SR_PLL_CF_START              0x15a, 0x80, 7

/** Offset for register PLL_DCU
 */
#define RG_PLL_DCU                       (0x15b)
  /** Access parameters for sub-register PLL_DCUW in register @ref RG_PLL_DCU
   */
#define SR_PLL_DCUW                  0x15b, 0x3f, 0
  /** Access parameters for sub-register PLL_DCU_START in register @ref RG_PLL_DCU
   */
#define SR_PLL_DCU_START             0x15b, 0x80, 7

/** Offset for register PART_NUM
 */
#define RG_PART_NUM                      (0x15c)
  /** Access parameters for sub-register PART_NUM in register @ref RG_PART_NUM
   */
#define SR_PART_NUM                  0x15c, 0xff, 0
  /** Constant ATmega128RFA1 for sub-register SR_PART_NUM */
#define ATMEGA128RFA1_PART_NUM           (131)

/** Offset for register VERSION_NUM
 */
#define RG_VERSION_NUM                   (0x15d)
  /** Access parameters for sub-register VERSION_NUM in register @ref RG_VERSION_NUM
   */
#define SR_VERSION_NUM               0x15d, 0xff, 0

/** Offset for register MAN_ID_0
 */
#define RG_MAN_ID_0                      (0x15e)
  /** Access parameters for sub-register MAN_ID_0 in register @ref RG_MAN_ID_0
   */
#define SR_MAN_ID_0                  0x15e, 0xff, 0

/** Offset for register MAN_ID_1
 */
#define RG_MAN_ID_1                      (0x15f)
  /** Access parameters for sub-register MAN_ID_1 in register @ref RG_MAN_ID_1
   */
#define SR_MAN_ID_1                  0x15f, 0xff, 0

/** Offset for register SHORT_ADDR_0
 */
#define RG_SHORT_ADDR_0                  (0x160)
  /** Access parameters for sub-register SHORT_ADDR_0 in register @ref RG_SHORT_ADDR_0
   */
#define SR_SHORT_ADDR_0              0x160, 0xff, 0

/** Offset for register SHORT_ADDR_1
 */
#define RG_SHORT_ADDR_1                  (0x161)
  /** Access parameters for sub-register SHORT_ADDR_1 in register @ref RG_SHORT_ADDR_1
   */
#define SR_SHORT_ADDR_1              0x161, 0xff, 0

/** Offset for register PAN_ID_0
 */
#define RG_PAN_ID_0                      (0x162)
  /** Access parameters for sub-register PAN_ID_0 in register @ref RG_PAN_ID_0
   */
#define SR_PAN_ID_0                  0x162, 0xff, 0

/** Offset for register PAN_ID_1
 */
#define RG_PAN_ID_1                      (0x163)
  /** Access parameters for sub-register PAN_ID_1 in register @ref RG_PAN_ID_1
   */
#define SR_PAN_ID_1                  0x163, 0xff, 0

/** Offset for register IEEE_ADDR_0
 */
#define RG_IEEE_ADDR_0                   (0x164)
  /** Access parameters for sub-register IEEE_ADDR_0 in register @ref RG_IEEE_ADDR_0
   */
#define SR_IEEE_ADDR_0               0x164, 0xff, 0

/** Offset for register IEEE_ADDR_1
 */
#define RG_IEEE_ADDR_1                   (0x165)
  /** Access parameters for sub-register IEEE_ADDR_1 in register @ref RG_IEEE_ADDR_1
   */
#define SR_IEEE_ADDR_1               0x165, 0xff, 0

/** Offset for register IEEE_ADDR_2
 */
#define RG_IEEE_ADDR_2                   (0x166)
  /** Access parameters for sub-register IEEE_ADDR_2 in register @ref RG_IEEE_ADDR_2
   */
#define SR_IEEE_ADDR_2               0x166, 0xff, 0

/** Offset for register IEEE_ADDR_3
 */
#define RG_IEEE_ADDR_3                   (0x167)
  /** Access parameters for sub-register IEEE_ADDR_3 in register @ref RG_IEEE_ADDR_3
   */
#define SR_IEEE_ADDR_3               0x167, 0xff, 0

/** Offset for register IEEE_ADDR_4
 */
#define RG_IEEE_ADDR_4                   (0x168)
  /** Access parameters for sub-register IEEE_ADDR_4 in register @ref RG_IEEE_ADDR_4
   */
#define SR_IEEE_ADDR_4               0x168, 0xff, 0

