avrxml/asf/thirdparty/atmel_rf4ce/lib/inc/atmega128rfa1.h
/** Offset for register IEEE_ADDR_5
 */
#define RG_IEEE_ADDR_5                   (0x169)
  /** Access parameters for sub-register IEEE_ADDR_5 in register @ref RG_IEEE_ADDR_5
   */
#define SR_IEEE_ADDR_5               0x169, 0xff, 0

/** Offset for register IEEE_ADDR_6
 */
#define RG_IEEE_ADDR_6                   (0x16a)
  /** Access parameters for sub-register IEEE_ADDR_6 in register @ref RG_IEEE_ADDR_6
   */
#define SR_IEEE_ADDR_6               0x16a, 0xff, 0

/** Offset for register IEEE_ADDR_7
 */
#define RG_IEEE_ADDR_7                   (0x16b)
  /** Access parameters for sub-register IEEE_ADDR_7 in register @ref RG_IEEE_ADDR_7
   */
#define SR_IEEE_ADDR_7               0x16b, 0xff, 0

/** Offset for register XAH_CTRL_0
 */
#define RG_XAH_CTRL_0                    (0x16c)
  /** Access parameters for sub-register SLOTTED_OPERATION in register @ref RG_XAH_CTRL_0
   */
#define SR_SLOTTED_OPERATION         0x16c, 0x01, 0
  /** Access parameters for sub-register MAX_CSMA_RETRIES in register @ref RG_XAH_CTRL_0
   */
#define SR_MAX_CSMA_RETRIES          0x16c, 0x0e, 1
   /** Constant XAH_CTRL_0_MAX_CSMA_RETRIES__00 for sub-register @ref SR_MAX_CSMA_RETRIES
    */
#define XAH_CTRL_0_MAX_CSMA_RETRIES__00 (0)
   /** Constant XAH_CTRL_0_MAX_CSMA_RETRIES__10 for sub-register @ref SR_MAX_CSMA_RETRIES
    */
#define XAH_CTRL_0_MAX_CSMA_RETRIES__10 (1)
   /** Constant XAH_CTRL_0_MAX_CSMA_RETRIES__20 for sub-register @ref SR_MAX_CSMA_RETRIES
    */
#define XAH_CTRL_0_MAX_CSMA_RETRIES__20 (2)
   /** Constant XAH_CTRL_0_MAX_CSMA_RETRIES__30 for sub-register @ref SR_MAX_CSMA_RETRIES
    */
#define XAH_CTRL_0_MAX_CSMA_RETRIES__30 (3)
   /** Constant XAH_CTRL_0_MAX_CSMA_RETRIES__40 for sub-register @ref SR_MAX_CSMA_RETRIES
    */
#define XAH_CTRL_0_MAX_CSMA_RETRIES__40 (4)
   /** Constant XAH_CTRL_0_MAX_CSMA_RETRIES__50 for sub-register @ref SR_MAX_CSMA_RETRIES
    */
#define XAH_CTRL_0_MAX_CSMA_RETRIES__50 (5)
   /** Constant XAH_CTRL_0_MAX_CSMA_RETRIES__60 for sub-register @ref SR_MAX_CSMA_RETRIES
    */
#define XAH_CTRL_0_MAX_CSMA_RETRIES__60 (6)
   /** Constant XAH_CTRL_0_MAX_CSMA_RETRIES__70 for sub-register @ref SR_MAX_CSMA_RETRIES
    */
#define XAH_CTRL_0_MAX_CSMA_RETRIES__70 (7)
  /** Access parameters for sub-register MAX_FRAME_RETRIES in register @ref RG_XAH_CTRL_0
   */
#define SR_MAX_FRAME_RETRIES         0x16c, 0xf0, 4
   /** Constant XAH_CTRL_0_MAX_FRAME_RETRIES__00 for sub-register @ref SR_MAX_FRAME_RETRIES
    */
#define XAH_CTRL_0_MAX_FRAME_RETRIES__00 (0)
   /** Constant XAH_CTRL_0_MAX_FRAME_RETRIES__10 for sub-register @ref SR_MAX_FRAME_RETRIES
    */
#define XAH_CTRL_0_MAX_FRAME_RETRIES__10 (1)
   /** Constant XAH_CTRL_0_MAX_FRAME_RETRIES__20 for sub-register @ref SR_MAX_FRAME_RETRIES
    */
#define XAH_CTRL_0_MAX_FRAME_RETRIES__20 (2)
   /** Constant XAH_CTRL_0_MAX_FRAME_RETRIES__30 for sub-register @ref SR_MAX_FRAME_RETRIES
    */
#define XAH_CTRL_0_MAX_FRAME_RETRIES__30 (3)
   /** Constant XAH_CTRL_0_MAX_FRAME_RETRIES__40 for sub-register @ref SR_MAX_FRAME_RETRIES
    */
#define XAH_CTRL_0_MAX_FRAME_RETRIES__40 (4)
   /** Constant XAH_CTRL_0_MAX_FRAME_RETRIES__50 for sub-register @ref SR_MAX_FRAME_RETRIES
    */
#define XAH_CTRL_0_MAX_FRAME_RETRIES__50 (5)
   /** Constant XAH_CTRL_0_MAX_FRAME_RETRIES__60 for sub-register @ref SR_MAX_FRAME_RETRIES
    */
#define XAH_CTRL_0_MAX_FRAME_RETRIES__60 (6)
   /** Constant XAH_CTRL_0_MAX_FRAME_RETRIES__70 for sub-register @ref SR_MAX_FRAME_RETRIES
    */
#define XAH_CTRL_0_MAX_FRAME_RETRIES__70 (7)
   /** Constant XAH_CTRL_0_MAX_FRAME_RETRIES__80 for sub-register @ref SR_MAX_FRAME_RETRIES
    */
#define XAH_CTRL_0_MAX_FRAME_RETRIES__80 (8)
   /** Constant XAH_CTRL_0_MAX_FRAME_RETRIES__90 for sub-register @ref SR_MAX_FRAME_RETRIES
    */
#define XAH_CTRL_0_MAX_FRAME_RETRIES__90 (9)
   /** Constant XAH_CTRL_0_MAX_FRAME_RETRIES__100 for sub-register @ref SR_MAX_FRAME_RETRIES
    */
#define XAH_CTRL_0_MAX_FRAME_RETRIES__100 (10)
   /** Constant XAH_CTRL_0_MAX_FRAME_RETRIES__110 for sub-register @ref SR_MAX_FRAME_RETRIES
    */
#define XAH_CTRL_0_MAX_FRAME_RETRIES__110 (11)
   /** Constant XAH_CTRL_0_MAX_FRAME_RETRIES__120 for sub-register @ref SR_MAX_FRAME_RETRIES
    */
#define XAH_CTRL_0_MAX_FRAME_RETRIES__120 (12)
   /** Constant XAH_CTRL_0_MAX_FRAME_RETRIES__130 for sub-register @ref SR_MAX_FRAME_RETRIES
    */
#define XAH_CTRL_0_MAX_FRAME_RETRIES__130 (13)
   /** Constant XAH_CTRL_0_MAX_FRAME_RETRIES__140 for sub-register @ref SR_MAX_FRAME_RETRIES
    */
#define XAH_CTRL_0_MAX_FRAME_RETRIES__140 (14)
   /** Constant XAH_CTRL_0_MAX_FRAME_RETRIES__150 for sub-register @ref SR_MAX_FRAME_RETRIES
    */
#define XAH_CTRL_0_MAX_FRAME_RETRIES__150 (15)

/** Offset for register CSMA_SEED_0
 */
#define RG_CSMA_SEED_0                   (0x16d)
  /** Access parameters for sub-register CSMA_SEED_0 in register @ref RG_CSMA_SEED_0
   */
#define SR_CSMA_SEED_0               0x16d, 0xff, 0
   /** Constant CSMA_SEED_0_CSMA_SEED_0__00 for sub-register @ref SR_CSMA_SEED_0
    */
#define CSMA_SEED_0_CSMA_SEED_0__00 (0)
   /** Constant CSMA_SEED_0_CSMA_SEED_0__10 for sub-register @ref SR_CSMA_SEED_0
    */
#define CSMA_SEED_0_CSMA_SEED_0__10 (1)
   /** Constant CSMA_SEED_0_CSMA_SEED_0__20 for sub-register @ref SR_CSMA_SEED_0
    */
#define CSMA_SEED_0_CSMA_SEED_0__20 (2)
   /** Constant CSMA_SEED_0_CSMA_SEED_0__30 for sub-register @ref SR_CSMA_SEED_0
    */
#define CSMA_SEED_0_CSMA_SEED_0__30 (3)
   /** Constant CSMA_SEED_0_CSMA_SEED_0__40 for sub-register @ref SR_CSMA_SEED_0
    */
#define CSMA_SEED_0_CSMA_SEED_0__40 (4)
   /** Constant CSMA_SEED_0_CSMA_SEED_0__50 for sub-register @ref SR_CSMA_SEED_0
    */
#define CSMA_SEED_0_CSMA_SEED_0__50 (5)
   /** Constant CSMA_SEED_0_CSMA_SEED_0__60 for sub-register @ref SR_CSMA_SEED_0
    */
#define CSMA_SEED_0_CSMA_SEED_0__60 (6)
   /** Constant CSMA_SEED_0_CSMA_SEED_0__70 for sub-register @ref SR_CSMA_SEED_0
    */
#define CSMA_SEED_0_CSMA_SEED_0__70 (7)
   /** Constant CSMA_SEED_0_CSMA_SEED_0__80 for sub-register @ref SR_CSMA_SEED_0
    */
#define CSMA_SEED_0_CSMA_SEED_0__80 (8)
   /** Constant CSMA_SEED_0_CSMA_SEED_0__90 for sub-register @ref SR_CSMA_SEED_0
    */
#define CSMA_SEED_0_CSMA_SEED_0__90 (9)
   /** Constant CSMA_SEED_0_CSMA_SEED_0__100 for sub-register @ref SR_CSMA_SEED_0
    */
#define CSMA_SEED_0_CSMA_SEED_0__100 (10)
   /** Constant CSMA_SEED_0_CSMA_SEED_0__110 for sub-register @ref SR_CSMA_SEED_0
    */
#define CSMA_SEED_0_CSMA_SEED_0__110 (11)
   /** Constant CSMA_SEED_0_CSMA_SEED_0__120 for sub-register @ref SR_CSMA_SEED_0
    */
#define CSMA_SEED_0_CSMA_SEED_0__120 (12)
   /** Constant CSMA_SEED_0_CSMA_SEED_0__130 for sub-register @ref SR_CSMA_SEED_0
    */
#define CSMA_SEED_0_CSMA_SEED_0__130 (13)
   /** Constant CSMA_SEED_0_CSMA_SEED_0__140 for sub-register @ref SR_CSMA_SEED_0
    */
#define CSMA_SEED_0_CSMA_SEED_0__140 (14)
   /** Constant CSMA_SEED_0_CSMA_SEED_0__150 for sub-register @ref SR_CSMA_SEED_0
    */
#define CSMA_SEED_0_CSMA_SEED_0__150 (15)

/** Offset for register CSMA_SEED_1
 */
#define RG_CSMA_SEED_1                   (0x16e)
  /** Access parameters for sub-register CSMA_SEED_1 in register @ref RG_CSMA_SEED_1
   */
#define SR_CSMA_SEED_1               0x16e, 0x07, 0
   /** Constant CSMA_SEED_1_CSMA_SEED_1__00 for sub-register @ref SR_CSMA_SEED_1
    */
#define CSMA_SEED_1_CSMA_SEED_1__00 (0)
   /** Constant CSMA_SEED_1_CSMA_SEED_1__10 for sub-register @ref SR_CSMA_SEED_1
    */
#define CSMA_SEED_1_CSMA_SEED_1__10 (1)
   /** Constant CSMA_SEED_1_CSMA_SEED_1__20 for sub-register @ref SR_CSMA_SEED_1
    */
#define CSMA_SEED_1_CSMA_SEED_1__20 (2)
   /** Constant CSMA_SEED_1_CSMA_SEED_1__30 for sub-register @ref SR_CSMA_SEED_1
    */
#define CSMA_SEED_1_CSMA_SEED_1__30 (3)
   /** Constant CSMA_SEED_1_CSMA_SEED_1__40 for sub-register @ref SR_CSMA_SEED_1
    */
#define CSMA_SEED_1_CSMA_SEED_1__40 (4)
   /** Constant CSMA_SEED_1_CSMA_SEED_1__50 for sub-register @ref SR_CSMA_SEED_1
    */
#define CSMA_SEED_1_CSMA_SEED_1__50 (5)
   /** Constant CSMA_SEED_1_CSMA_SEED_1__60 for sub-register @ref SR_CSMA_SEED_1
    */
#define CSMA_SEED_1_CSMA_SEED_1__60 (6)
   /** Constant CSMA_SEED_1_CSMA_SEED_1__70 for sub-register @ref SR_CSMA_SEED_1
    */
#define CSMA_SEED_1_CSMA_SEED_1__70 (7)
  /** Access parameters for sub-register AACK_I_AM_COORD in register @ref RG_CSMA_SEED_1
   */
#define SR_AACK_I_AM_COORD           0x16e, 0x08, 3
  /** Access parameters for sub-register AACK_DIS_ACK in register @ref RG_CSMA_SEED_1
   */
#define SR_AACK_DIS_ACK              0x16e, 0x10, 4
  /** Access parameters for sub-register AACK_SET_PD in register @ref RG_CSMA_SEED_1
   */
#define SR_AACK_SET_PD               0x16e, 0x20, 5
  /** Access parameters for sub-register AACK_FVN_MODE in register @ref RG_CSMA_SEED_1
   */
#define SR_AACK_FVN_MODE             0x16e, 0xc0, 6
   /** Constant CSMA_SEED_1_AACK_FVN_MODE__00 for sub-register @ref SR_AACK_FVN_MODE
    */
#define CSMA_SEED_1_AACK_FVN_MODE__00 (0)

/** Constant PD_ACK_BIT_SET_DISABLE for sub-register AACK_SET_PD in register RG_CSMA_SEED_1 */
#define PD_ACK_BIT_SET_DISABLE      (0)

/** Constant PD_ACK_BIT_SET_ENABLE for sub-register AACK_SET_PD in register RG_CSMA_SEED_1 */
#define PD_ACK_BIT_SET_ENABLE      (1)

/** Constant FRAME_VERSION_0 for sub-register AACK_FVN_MODE in register RG_CSMA_SEED_1 */
#define FRAME_VERSION_0         (0)

