avrxml/asf/thirdparty/atmel_rf4ce/lib/inc/atmega128rfa1.h
/** Constant FRAME_VERSION_01 for sub-register AACK_FVN_MODE in register RG_CSMA_SEED_1 */
#define FRAME_VERSION_01         (1)

/** Constant FRAME_VERSION_012 for sub-register AACK_FVN_MODE in register RG_CSMA_SEED_1 */
#define FRAME_VERSION_012         (2)

/** Constant FRAME_VERSION_IGNORED for sub-register AACK_FVN_MODE in register RG_CSMA_SEED_1 */
#define FRAME_VERSION_IGNORED         (3)

/** Offset for register CSMA_BE
 */
#define RG_CSMA_BE                       (0x16f)
  /** Access parameters for sub-register MIN_BE in register @ref RG_CSMA_BE
   */
#define SR_MIN_BE                    0x16f, 0x0f, 0
   /** Constant CSMA_BE_MIN_BE__00 for sub-register @ref SR_MIN_BE
    */
#define CSMA_BE_MIN_BE__00       (0)
   /** Constant CSMA_BE_MIN_BE__10 for sub-register @ref SR_MIN_BE
    */
#define CSMA_BE_MIN_BE__10       (1)
   /** Constant CSMA_BE_MIN_BE__20 for sub-register @ref SR_MIN_BE
    */
#define CSMA_BE_MIN_BE__20       (2)
   /** Constant CSMA_BE_MIN_BE__30 for sub-register @ref SR_MIN_BE
    */
#define CSMA_BE_MIN_BE__30       (3)
   /** Constant CSMA_BE_MIN_BE__40 for sub-register @ref SR_MIN_BE
    */
#define CSMA_BE_MIN_BE__40       (4)
   /** Constant CSMA_BE_MIN_BE__50 for sub-register @ref SR_MIN_BE
    */
#define CSMA_BE_MIN_BE__50       (5)
   /** Constant CSMA_BE_MIN_BE__60 for sub-register @ref SR_MIN_BE
    */
#define CSMA_BE_MIN_BE__60       (6)
   /** Constant CSMA_BE_MIN_BE__70 for sub-register @ref SR_MIN_BE
    */
#define CSMA_BE_MIN_BE__70       (7)
   /** Constant CSMA_BE_MIN_BE__80 for sub-register @ref SR_MIN_BE
    */
#define CSMA_BE_MIN_BE__80       (8)
  /** Access parameters for sub-register MAX_BE in register @ref RG_CSMA_BE
   */
#define SR_MAX_BE                    0x16f, 0xf0, 4
   /** Constant CSMA_BE_MAX_BE__30 for sub-register @ref SR_MAX_BE
    */
#define CSMA_BE_MAX_BE__30       (3)
   /** Constant CSMA_BE_MAX_BE__40 for sub-register @ref SR_MAX_BE
    */
#define CSMA_BE_MAX_BE__40       (4)
   /** Constant CSMA_BE_MAX_BE__50 for sub-register @ref SR_MAX_BE
    */
#define CSMA_BE_MAX_BE__50       (5)
   /** Constant CSMA_BE_MAX_BE__60 for sub-register @ref SR_MAX_BE
    */
#define CSMA_BE_MAX_BE__60       (6)
   /** Constant CSMA_BE_MAX_BE__70 for sub-register @ref SR_MAX_BE
    */
#define CSMA_BE_MAX_BE__70       (7)
   /** Constant CSMA_BE_MAX_BE__80 for sub-register @ref SR_MAX_BE
    */
#define CSMA_BE_MAX_BE__80       (8)

#define RG_TST_RX_LENGTH                 (0x17b)

#endif /* #if (TAL_TYPE == ATMEGARF_TAL_1) */

#endif /* ATMEGA128RFA1_H */
